TaskListTextString={}
TaskListTextString[6835] = {
	--1~5
	"这是测试脚本对话额外参数的任务。",
	"",
	"",
	"",
	"你好，年轻人！",

	--6~10
	"你好, 有什么需要帮忙的吗？",
	"懒得理你。",
	"能帮去杀21号怪吗？",
	"没问题！（得3倍奖励）",
	"能再说一遍吗？",

	--11~15
	"不好意思，没空。",
	"谢谢你，年轻人！",
	"不客气！（得3倍奖励）",
	"我试试看。(得1倍奖励)",
	"得了，你给我多少好处啊?（得1倍奖励）",
}

TaskListTextString[3756] = {
	--1~5
	"甜蜜梦境的配制方法可不是那么容易得到，当然你如果能帮露亚找齐她想要的东西，她会很乐意教给你的。",
	"给予所有声望5000点。",
	"去跟贝尔谈一谈。",
	"到达2号地图-300 300",
	"你好，年轻人！",

	--6~10
	"你好, 有什么需要帮忙的吗？",
	"懒得理你。",
	"能帮去杀10个哥布林吗?",
	"没问题！",
	"能再说一遍吗？",

	--11~15
	"不好意思，没空。",
	"谢谢你，年轻人！",
	"不客气！",
	"我试试看。",
	"得了，你给我多少好处啊?"
}

TaskListTextString[6717] = {
	--1
	"你即将开始你的交涉生涯，用你的智慧和行动在这个纷繁复杂的世界写下属于你自己的一笔！你会遇见各式各样的组织和个人，或善良，或邪恶，或诚恳，或狡诈。你可以夸夸其谈，也可以言出必行；你可以饱含着善意的说服某人，也可以似恶棍一般胁迫某人。无论你采取什么方式，你得相信，你影响着这个世界，这个世界也影响着你！",
}

TaskListTextString[7700] = {
	--1~5
	"        毫无疑问，里奥将给你一个好的开始，其中的过程需要你自己把握，最后你有可能变成智者，社交大师，也有可能成为一无是处的棒槌。无论如何，开始你的交涉生涯吧，不要等鞭子抽到你的屁股时才行动。\r        充分利用你的能力，让你的雇主心想事成！",
	"发放任务奖励。",
	" ",
	" ",
	"你好，年轻人！社交任务？",--发放任务用对话






	--6~7
	"是的！",
	"我没时间。",

}

TaskListTextString[7680] = {
	--1~5
	"        近期，由于战斗的需要，石工玫瑰委托公会对工匠们开启了一项定向募捐活动，杰西卡会告诉你今天需要募集的产品。\r        当然所有募捐物品一定是你有能力制造的东西。\r\r^006acc任务提示：如果所需求的物品你因为种种原因没有学会制作，你也可以向游戏内的其他朋友索要。",
	"发放任务奖励。",
	" ",
	" ",
	"        我们的士兵正在为了保卫家园而努力，我们为此感到安全。公会代表石工玫瑰正在为前线募集军用物品，感谢你关注石工玫瑰的募捐活动，来看看今天的募捐内容？",--发放任务用对话






	--6~7
	"好的。",
	"对不起，我没有余力帮助别人。",
	"有你这样正义和富有爱心的伙伴，我为石工玫瑰骄傲！",
	"这是我们每一个人应该做的。",
	"等等，先生，我还要再考虑一下。"
}

TaskListTextString[7787] = {
	--1~5
	"        厨师预备式。\r        如何来感受这次厨师体验？《厨师预备式指南》上写的异常清楚。\r\r^006acc任务提示：如果你不知道所需物品的做法，可以向米歇尔索要《厨师预备式指南》。这本书分为两章，分别指导你制作不同的食物，如果你时间有限，请有选择性的阅读某一章。",
	"米歇尔：你做的非常好！。",
	"你好，年轻人！厨师的工作并没有别人想象的那么简单，也许我额外提供给你一个练习的机会，如果你不会烹饪，那么可以体验一下，如果已经学会，还有可能获得技能的提升！",--发放任务用对话





	"好的，非常感谢！",
	"我没时间。",

	--6~8
	"看来这次练习你完成的非常好，这有没有让你对烹饪更有兴趣呢？",
	"这确实是一门不错的技艺。",
	"确实很有趣。"

}

TaskListTextString[8089] = {
	--1~2
	"        在此，根据你们的表现支付佣金。我们需要扣除死亡将士的抚恤金，所以你们的所得与生还将士的数量成正比。生命可贵，对于战死沙场的将士，我们必须照顾他们的家人，希望你们理解。",
	"谢谢。",

}

--少数诀任务对话
TaskListTextString[8162] = {
	--1~5
	"今后商会对旗下商人的利益提成是应该增加呢还是应该减少？",
	"A：投票“增加提成”",
	"B：投票“减少提成”",
	"商会是否要开始主动介入，控制市场物价？",
	"A：投票“应该控制物价”",

	--6~10
	"B：投票“应该放任市场自由发展”",
	"商会应该将继续大部分资金投入到自由港的资本运作之中还是开始将资金转移投资遗忘之海的开发？",
	"A：投票“继续在自由港运作资金”",
	"B：投票“投资遗忘之海开发”",
	"你是否支持商会进行行业垄断？",

	--11~20
	"A：投票“我支持垄断”",
	"B：投票“我反对垄断”",
	"你觉得今后商会应该以利益为先，还是应该以诚信为先？",
	"A：投票：“以利益为先”",
	"B：投票：“以诚信为先”",

	"你觉得目前的物价是否过高？",
	"A：投票：“过高”",
	"B：投票：“不高”",
	"你是否愿意做一个奸商？",
	"A：投票：“我愿意”",

	--21~30
	"B：投票：“我不愿意”",
	"为了更大地扩大商会利润，下一步投资应该更加针对男性市场还是女性市场？",
	"A：投票：“男性市场”",
	"B：投票：“女性市场”",
	"你觉得商会目前应该进行高风险高回报的投资，还是进行稳妥但是收益较低的投资呢？",
	"A：投票：“高风险高回报”",
	"B：投票：“稳妥为上”",
	"我们应该加大投资自由港的食品业还是药品业呢？",
	"A：投票：“食品业”",
	"B：投票：“药品业”",

	--31~35
	"我们应该加大投资自由港的食品业还是药品业呢？",
	"A：投票：“食品业”",
	"B：投票：“药品业”",
	"",
	"",

	--36~40
	"",
	"",
	"",
	"",
	"",

	--41~45
	"",
	"",
	"",
	"",
	"",

	--46~50
	"",
	"",
	"",
	"",
	"",

	--51~55
	"",
	"",
	"",
	"",
	"",

	--56~60
	"",
	"",
	"",
	"",
	"",

	--61~65
	"你需要认真地观看投票的题目，然后在限定时间内做出选择。请注意，这些题目本身并没有一个标准的答案，只有当你的选择成为少数人的选择时，你才能脱颖而出，获得奖励并进入下一轮投票。",
	"测试。",
	"你要进入投票环节么？进入投票环节后你可以在这里进行自己的投票，或者在投票前去说服其它大会成员按你所希望的进行投票。（接受任务后请关闭对话框）",
	"进入投票环节",
	"我等会再进行投票。",
}

TaskListTextString[8193] = {
	--1~5
	"        你将你的选票投给了A选项，那么请祈祷投B选项的人数要比A选项的多吧。因为只有那样你才能获得胜利。\r        当投票结果出来后如果你没有及时去揭晓结果，视为投票失败，将扣除一枚代币。",
	" ",
	"投票结果即将揭晓，唔好你的小心肝，可别让它从你的嗓子眼里跳了出来。",
	"快点揭晓吧！",
}

TaskListTextString[8194] = {
	--1~5
	"        你将你的选票投给了B选项，那么请祈祷投A选项的人数要比B选项的多吧。因为只有那样你才能获得胜利。\r        当投票结果出来后如果你没有及时去揭晓结果，视为投票失败，将扣除一枚代币。",
	" ",
	"投票结果即将揭晓，捂好你的小心肝，可别让它从你的嗓子眼里跳了出来。",
	"快点揭晓吧！",
}

TaskListTextString[8204] = {
	--1~5
	"        近期，石工玫瑰接受了狮心骑士团的委托，向广大民众征集战备物资。海伦坡会告诉你需要征集的产品。\r        当然所有征集的物资一定不会太过分，你也有权利拒绝帮助石工玫瑰和前线的士兵。\r\r^006acc任务提示：如果所需求的物品你无法自己制作，请向周围其他朋友求助。\r此任务每天可完成3次，获得的经验奖励随着完成次数的增多将会大幅增加。",
	"感谢辞！",
	"        勇敢的士兵正在为了保卫家园而浴血奋战，我们虽然不能踏上战场但是仍然要为生活的家园做些什么。石工玫瑰受狮心骑士团的委托正在为前线募集军用物品，感谢你关注我们的征集活动，我们需要你的帮助！",
	"需要什么，请尽管开口。",
	"对不起，我还没有这个能力帮助别人。",

	--6~7
	"代表石工玫瑰感谢你的慷慨！",
	"这是我应该做的。",
}

--基础建设任务
TaskListTextString[8547] = {
	--1~5
	"        公会的进步离不开每一位成员的努力，我们都知道我们会成为克兰蒙多最著名的公会之一，只不过千里之行始于足下，这个伟大的目标得一步一步从基础建设开始。\r\r^006acc任务提示：接受此事务的同时将接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、工会资金的增长，以及资源值的提升。",
	"$name已经完成了一轮的建设任务！感谢他为公会而做出的努力！",
	"每个公会成员的努力，都可以为公会带来收益！怎么样！&name&,你准备好为公会贡献你的一份力量了吗？",
	"时刻准备效劳！",
	"不，我还有更重要的事情要做。",

	--6~8
	"你已经完成这次公会交给你的事务了吗？",
	"是的。",
	"稍等一下，我还没有完成。",
}

--公会城堡任务
TaskListTextString[8548] = {
	--1~5
	"        最强的防守就是进攻！要显示武力，才能让人臣服，这就是城堡修筑的意义！你问武力与修筑的关系？要知道，我们的城堡中最有战斗力的就是驻守的兵士！所以，磨练武力吧！你任何的努力某种程度上都会影响武力的磨练！\r\r^006acc任务提示：接受此事务的同时你将会接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、工会资金的增长，以及资源值的提升。",
	"这里是感谢辞。",
	"强大的武力是安身的保障！我们需要不断提升自己的战斗力才能立于不败之地！而公会一切的建设都会对我们的战斗力有影响！别闲着了，来干点实事儿吧？",
	"我很乐意！",
	"不，我还有更重要的事情要做。",

	--6~8
	"你已经完成这次公会交给你的事务了吗？",
	"是的。",
	"稍等一下，我还没有完成。",
}

--住房任务
TaskListTextString[8549] = {
	--1~5
	"        随着公会的繁荣，建筑会越来越多，人口当然也越来越多，然而空间却是如此有限，这就需要我们考虑如何在有限的空间里营造出更加舒适的居住环境，也就是我们的住房改造建设。来吧，哪怕是一张羊皮纸都会对我们有所帮助！\r\r^006acc任务提示：接受此事务的同时你将会接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、工会资金的增长，以及资源值的提升。",
	"这里是感谢辞。",
	"好的住房建设会为我们的勇士提供好的休息环境，也能在某种程度上降低我们的维护费用！这可是一笔不小的开销！不管你手上有金子还是石头甚至一张羊皮纸，都能帮上住房建设的忙！",
	"我愿意出力！",
	"不，我还有更重要的事情要做。",

	--6~8
	"你已经完成这次公会交给你的事务了吗？",
	"是的。",
	"稍等一下，我还没有完成。",
}

--金库
TaskListTextString[8550] = {
	--1~5
	"        这是个现实的世界，大部分的运作都需要钱。谁都希望晨光洒落的时候金币从天上叮当作响的砸下来，但是，孩子，醒醒吧，金子还是要自己去赚的，小到你自己，大到公会都是这样，为金库的扩建出把力吧，公会的钱袋就会宽裕些。\r\r^006acc任务提示：接受此事务的同时你将会接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、工会资金的增长，以及资源值的提升。",
	"这里是感谢辞。",
	"钱！钱！钱！我快被钱逼疯了！公会什么事儿能离开钱呢？这些都要靠我来想办法！好在这世上大部分东西都能卖了换钱！&name&，如果你有空就来帮帮我的忙！不管你能弄到什么，我都有法子把它变成钱币！",
	"我愿意帮忙。",
	"不，我还有更重要的事情要做。",

	--6~8
	"你已经完成这次公会交给你的事务了吗？",
	"是的。",
	"稍等一下，我还没有完成。",
}

--宴会厅装修
TaskListTextString[8551] = {
	--1~5
	"        吃喝永远是最重要的。毕竟我们不是那些什么不死军团，只不过当吃喝这种事上升到宴会和酒会的高度，就成了很麻烦的问题。为了公会的宴会厅，来干点力所能及的吧。\r\r^006acc任务提示：接受此事务的同时你将会接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、工会资金的增长，以及资源值的提升。",
	"这里是感谢辞。",
	"我想不出还有什么事儿比“吃”更重要了。偏偏我们什么都缺少，食材、食谱、甚至连宴会厅的建筑都要筹备！无论需要什么，你都得来搭把手！",
	"我愿意效劳！",
	"不，我还有更重要的事情要做。",

	--6~8
	"你已经完成这次公会交给你的事务了吗？",
	"是的。",
	"稍等一下，我还没有完成。",
}
--xiao 社交家：我在克兰蒙多的日子
TaskListTextString[9619] = {
	--1~3
	"毫无疑问，我们都是生活在克兰蒙多这片海洋之中的沙子，其中一部分，永远的沉入海底，变成泥沙。另一部分，随着海浪起伏，穿越泡沫般的波涛，最后掀上空中，落在岸边的沙滩上。正因为如此，悲伤的人认为人生毫无意义，喜悦的人则喜欢那种随波起伏的感觉，伟大的人，则在穿越那些泡沫般的波涛时学会一些东西。我希望你成为伟大的人，伟大的社交家，接下来，我将展现在你面前的，就是你的生活，在科莱蒙多的生活。我希望，当你这颗沙子被冲上海滩的时候，能够回忆起你遇见的那些人，那些事，那些情感。",
	"说得好！这正是我想要的生活。",
	"我对社交家不敢兴趣。",
	"找到社交家卡西，开始你在克兰蒙多的日子！"

}
--xiao 自由港生活
TaskListTextString[9706] = {
        DeliverTalkNpc = "        欢迎你参加自由生活训练营。每天我会交给你不同的事情去做，有的很简单，有些需要点难度。在自由港，你永远都有表达自由的权利，这也是我们自由生活训练营的宗旨。请记住，你可以不选择自由，但请不要放弃自由。",
        DeliverTalkPlayer = "我参加。",
        AwardTalkNpc = "        你做的很好，我相信会成为其他人的榜样。嗯，下面还有什么来着……",
        AwardTalkPlayer = "完成.",
        CompleteTaskCommon = "了解这个世界",
		BroadCast = "^ffd700你增加了 1点 活跃度",
		Prefix = "^006acc极效生活次数：剩余 %d 次\r^50210f",
		SubmitItemText1 = "上交魔宠原石",
		SubmitItemPrologue1 = "自由生活训练营需要一枚魔宠原石，熊、密林之友或者蜘蛛中的任何一种都可以，原石品质要求是“白色”。^0e900e如果你能上交一枚绿色品质的原石，将会额外获得一些经验。",
		SubmitItemText2 = "上交魔宠原石",
		SubmitItemPrologue2 = "自由生活训练营需要一枚魔宠原石，机关人、矮人或者丛林黑豹中的任何一种都可以，原石品质要求是“白色”。^0e900e如果你能上交一枚绿色品质的原石，将会额外获得一些经验。",

        [11]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-293,219,-74,1)雷吉琼斯&讲解：自由的代价",
        [12]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-245,228,53,1)莉迪娅&讲解：安吉尔",
        [13]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-30,218,20,1)金狮公爵瓦西里&讲解：我们的城市",
        [14]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-293,219,-74,1)雷吉琼斯&讲解：暴风军团的威胁",
        [15]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-140,225,72,1)阿莱恩&讲解：破碎的世界",
        [16]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-154,225,58,1)大占星师&讲解：星座纪元",
        [17]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-183,228,-119,1)杰西卡&讲解：团结不可战胜",
        [18]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-172,235,-39,1)尼亚奇洛&讲解：大陆的起源",
        [19]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-181,228,-116,1)玛莎&讲解：命运星轮",
        [20]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-172,229,-23,1)布克雷&讲解：第一次尼诺战争",
        [21]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-172,229,-23,1)布克雷&讲解：第二次尼诺战争",
        [22]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-172,235,-39,1)尼亚奇洛&讲解：众神战争",
        [23]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-265,219,-113,1)格洛尔尼&讲解：最美的女人",
        [24]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-277,208,-363,1)守墓人&讲解：莫卡雷希的预言",
        [25]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-172,235,-39,1)尼亚奇洛&讲解：世界之树",
        [26]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-181,228,-116,1)玛莎&讲解：光明与黑暗",
        [27]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-154,225,58,1)大占星师&讲解：神选中的星座",
        [28]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请通过&pos:(-44,215,-110,1)旗舰号船长&的帮助前往锡月林地，听取&pos:(260,283,-153,2)兰黛斯·神恩&讲解：圣树的灵魂",
        [29]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-293,219,-74,1)雷吉琼斯&讲解：狄赛奥的复活",
        [30]="熟知我们所处这个世界的历史典故，是自由港生活的一部分。请听取&pos:(-30,218,20,1)金狮公爵瓦西里&讲解：欧斯特的黑暗十年",
        [31]="这个世界的各个组成部分，都影响着我们的生活。请听取黄金眼拍卖行的&pos:(-311,220,36,1)奥巴贡&讲解：忙碌的拍卖师",
        [32]="这个世界的各个组成部分，都影响着我们的生活。请听取狮心骑士团竞技场管理员&pos:(-293,219,-65,1)鲍威尔&讲解：热血斗魂！",
        [40]="&pos:(-266,228,-15,1)吟游学者里奥&交游广阔，他了解自由港很多人的愿望。自由生活训练营的一项重要内容，就是满足自由港市民的愿望，得到他们的心愿卡。",
        [41]="自由港面朝大海，隔海遥望破碎的辛图拉，是对抗暴风军团的门户。请到城市的&pos:(-6,215,4,1)最东端&，看看海上是否有暴风军团入侵的踪迹。",
        [42]="当年暴风军团终于被击退，人们为自由港的重生而欢呼的时候，一颗流动着蓝色魔力的大树在一夜之间长成。这就是花街尽头的胜利之树。请前往&pos:(-62,223,-37,1)胜利之树&下感受当年血与火的荣耀吧！",
        [43]="魔力之泉给自由港提供的不仅是充沛的魔法护盾，更重要的是希望的源泉，让希望之光在这座城市生生不息。请代表我前往&pos:(-205,228,-106,1)魔力之泉&表达敬意。",
        [60]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！",
        [61]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！",
        [62]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！",
        [63]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！",
        [64]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！",
        [65]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！彩虹岛北方的小岛，是暴风傀儡聚集之地。",
        [66]="和平生活的后盾是战斗力量。请你除掉魔物，证明自己具有捍卫自由的能力！你需要前往锡月林地。",
        [67]="和平生活的后盾是战斗力量。请你除掉魔物，证明自己具有捍卫自由的能力！你需要前往锡月林地。",
        [68]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！暴风割裂者隐藏在黄金海岸的最南端。",
        [69]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！辉煌遗迹是你的目的地。",
        [70]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！辉煌遗迹是你的目的地。",
        [71]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！辉煌遗迹是你的目的地。",
        [72]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！辉煌遗迹是你的目的地。",
        [73]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！辉煌遗迹是你的目的地。",
        [74]="和平生活的后盾是战斗力量。请你除掉科莱斯平原的魔物，证明自己具有捍卫自由的能力！辉煌遗迹是你的目的地。",
        [130]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量初级生命药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [131]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量次级生命药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [132]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量中级生命药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [133]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量生命药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [134]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量高级生命药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [135]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量高级生命药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [136]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量初级魔法药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [137]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量次级魔法药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [138]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量中级魔法药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [139]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量魔法药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [140]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量高级魔法药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [141]="药水战士据说是连神都奈何不了的。喝药不息，生命不止。训练这样的人才需要大量高级魔法药水，请你帮我向&pos:(-109,215,-62,1)药品商&采购一些吧。",
        [142]="当一个人在勇猛地剿除魔物的时候，如果身边有一个魔宠，生活也变得不那么孤独了吧！请立即向&pos:(-90,215,-49,1)魔宠商人&购买魔宠药水以备需要。",
        [143]="当一个人在勇猛地剿除魔物的时候，如果身边有一个魔宠，生活也变得不那么孤独了吧！请立即向&pos:(-90,215,-49,1)魔宠商人&购买魔宠药水以备需要。",
        [144]="当一个人在勇猛地剿除魔物的时候，如果身边有一个魔宠，生活也变得不那么孤独了吧！请立即向&pos:(-90,215,-49,1)魔宠商人&购买魔宠药水以备需要。",
        [145]="当一个人在勇猛地剿除魔物的时候，如果身边有一个魔宠，生活也变得不那么孤独了吧！请立即向&pos:(-90,215,-49,1)魔宠商人&购买魔宠药水以备需要。",
        [146]="当一个人在勇猛地剿除魔物的时候，如果身边有一个魔宠，生活也变得不那么孤独了吧！请立即向&pos:(-90,215,-49,1)魔宠商人&购买魔宠药水以备需要。",
        [147]="当一个人在勇猛地剿除魔物的时候，如果身边有一个魔宠，生活也变得不那么孤独了吧！请立即向&pos:(-90,215,-49,1)魔宠商人&购买魔宠药水以备需要。",
        [160]="作为自由港唯一的酒馆，居然还是在一艘船上。请你帮我从&pos:(-45,215,-144,1)酒馆老板&那里买一瓶好酒来，我都快等不及了。",
        [161]="作为自由港唯一的酒馆，居然还是在一艘船上。请你帮我从&pos:(-45,215,-144,1)酒馆老板&那里买一瓶好酒来，我都快等不及了。",
        [162]="作为自由港唯一的酒馆，居然还是在一艘船上。请你帮我从&pos:(-45,215,-144,1)酒馆老板&那里买一瓶好酒来，我都快等不及了。",
        [163]="作为自由港唯一的酒馆，居然还是在一艘船上。请你帮我从&pos:(-45,215,-144,1)酒馆老板&那里买一瓶好酒来，我都快等不及了。",
        [164]="美妙的生活离不开美食享受。你不知道我还是个烹调高手吧！请帮我从&pos:(-121,215,-78,1)大厨师&那里买些烹饪材料来，我要在大家面前露一手。",
        [165]="美妙的生活离不开美食享受。你不知道我还是个烹调高手吧！请帮我从&pos:(-121,215,-78,1)大厨师&那里买些烹饪材料来，我要在大家面前露一手。",
        [166]="美妙的生活离不开美食享受。你不知道我还是个烹调高手吧！请帮我从&pos:(-121,215,-78,1)大厨师&那里买些烹饪材料来，我要在大家面前露一手。",
        [167]="美妙的生活离不开美食享受。你不知道我还是个烹调高手吧！请帮我从&pos:(-121,215,-78,1)大厨师&那里买些烹饪材料来，我要在大家面前露一手。",
        [168]="美妙的生活离不开美食享受。你不知道我还是个烹调高手吧！请帮我从&pos:(-121,215,-78,1)大厨师&那里买些烹饪材料来，我要在大家面前露一手。",
        [169]="美妙的生活离不开美食享受。你不知道我还是个烹调高手吧！请帮我从&pos:(-121,215,-78,1)大厨师&那里买些烹饪材料来，我要在大家面前露一手。",
        [170]="自由生活训练营的零食是城市里的&pos:(-282,219,32,1)杂货商&供应的，请你去帮我买回一些来。",
        [171]="自由生活训练营的零食是城市里的&pos:(-282,219,32,1)杂货商&供应的，请你去帮我买回一些来。",
        [172]="自由生活训练营的零食是城市里的&pos:(-282,219,32,1)杂货商&供应的，请你去帮我买回一些来。",
        [173]="自由生活训练营的零食是城市里的&pos:(-282,219,32,1)杂货商&供应的，请你去帮我买回一些来。",
        [174]="我想品尝一下炉火村出产的美酒，每天在大广场上来回晃荡的胖大叔那里有得卖。请你去帮我买一瓶来。",
        [175]="我想品尝一下德玛尔郡出产的美酒，每天在大广场上来回晃荡的胖大叔那里有得卖。请你去帮我买一瓶来。",
        [180]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-269,231,22,1)食品商&处买一本回来。",
        [181]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-269,231,22,1)食品商&处买一本回来。",
        [182]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [183]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-269,231,22,1)食品商&处买一本回来。",
        [184]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-269,231,22,1)食品商&处买一本回来。",
        [185]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [186]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-163,209,178,1)渔童&处买一本回来。",
        [187]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [188]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [189]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-163,209,178,1)渔童&处买一本回来。",
        [190]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [191]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [192]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [193]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [194]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-163,209,178,1)渔童&处买一本回来。",
        [195]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [196]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [197]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [198]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [199]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [200]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-163,209,178,1)渔童&处买一本回来。",
        [201]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [202]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [203]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [204]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-163,209,178,1)渔童&处买一本回来。",
        [205]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-163,209,178,1)渔童&处买一本回来。",
        [206]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [207]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [208]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [209]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [210]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [211]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [212]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [213]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [214]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [215]="自由生活训练营每天都有推荐的食谱，奖励给喜欢吃喝的同学。请你帮我从&pos:(-121,215,-78,1)大厨师&处买一本回来。",
        [216]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [217]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [218]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [219]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [220]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [221]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [222]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [223]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [224]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [225]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [226]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [227]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [228]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [229]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [230]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [231]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [232]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [233]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [234]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [235]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [236]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [237]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [238]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [239]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [240]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [241]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [242]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [243]="&pos:(-107,215,-63,1)炼金术导师&有我需要的炼金配方，你能不能帮我买一本呢？",
        [244]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [245]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [246]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [247]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [248]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [249]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [250]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [251]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [252]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [253]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [254]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [255]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [256]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [257]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [258]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [259]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [260]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [261]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [262]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [263]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [264]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [265]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [266]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [267]="&pos:(-121,215,-121,1)工艺导师&有我需要的工艺图样，请你去帮我买一本，这对于你来说很容易。",
        [268]="&pos:(-121,215,-124,1)分解术导师&有我需要的分解术公式，请你去帮我买一本，并不会占用你很多时间的，不是吗？",
        [269]="&pos:(-121,215,-124,1)分解术导师&有我需要的分解术公式，请你去帮我买一本，并不会占用你很多时间的，不是吗？",
        [270]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [271]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [272]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [273]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [274]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [275]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [276]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [277]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [278]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [279]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [280]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [281]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [282]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [283]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [284]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [285]="&pos:(-125,215,-83,1)武器制造导师&有我需要的武器制造图纸，请你去帮我买一份。",
        [286]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [287]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [288]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [289]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [290]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [291]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [292]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [293]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [294]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [295]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [296]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [297]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [298]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [299]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于重甲吧！",
        [300]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [301]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [302]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [303]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [304]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [305]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [306]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [307]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [308]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [309]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [310]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [311]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [312]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [313]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [314]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [315]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [316]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [317]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [318]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [319]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [320]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于轻甲吧！",
        [321]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [322]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [323]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [324]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [325]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [326]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [327]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [328]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [329]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [330]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [331]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [332]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [333]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [334]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [335]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [336]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [337]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [338]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [339]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [340]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [341]="&pos:(-133,215,-96,1)防具制造导师&有我需要的防具制造图样，请你去帮我买一份。什么重甲、轻甲、布艺，它们究竟有什么区别？这本图样应该是属于布艺吧！",
        [410]="透过镶金瓶可以看到炼金术浪漫的秘密。请帮我从&pos:(-107,215,-63,1)炼金术导师&那里买几瓶镶金瓶来。",
        [411]="透过镶金瓶可以看到炼金术浪漫的秘密。请帮我从&pos:(-107,215,-63,1)炼金术导师&那里买几瓶镶金瓶来。",
        [412]="透过镶金瓶可以看到炼金术浪漫的秘密。请帮我从&pos:(-107,215,-63,1)炼金术导师&那里买几瓶镶金瓶来。",
        [413]="透过镶金瓶可以看到炼金术浪漫的秘密。请帮我从&pos:(-107,215,-63,1)炼金术导师&那里买几瓶镶金瓶来。",
        [414]="工艺师通过手中的工具把腐朽化为神奇。请帮我从&pos:(-121,215,-121,1)工艺导师&那里买一些金属扣环。",
        [415]="透过镶金瓶可以看到炼金术浪漫的秘密。请帮我从&pos:(-107,215,-63,1)炼金术导师&那里买几瓶镶金瓶来。",
        [460]="享受自由生活也千万不能忽视暴风军团的威胁。科莱斯平原上无处不在的暴风刺客、暴风逃犯和暴风信使身上带有狄赛奥的信物。请你表现一下你必须具有的能力。小心！在科莱斯平原杀死15级以上的魔物，暴风刺客和暴风逃犯就有可能偷偷出现在你身后。",
        [461]="享受自由生活也千万不能忽视暴风军团的威胁。科莱斯平原上无处不在的暴风刺客、暴风逃犯和暴风信使身上带有狄赛奥的信物。请你表现一下你必须具有的能力。小心！在科莱斯平原杀死16级以上的魔物，暴风刺客和暴风逃犯就有可能偷偷出现在你身后。",
        [462]="享受自由生活也千万不能忽视暴风军团的威胁。科莱斯平原上无处不在的暴风刺客、暴风逃犯和暴风信使身上带有狄赛奥的信物。请你表现一下你必须具有的能力。小心！在科莱斯平原杀死17级以上的魔物，暴风刺客和暴风逃犯就有可能偷偷出现在你身后。",
        [463]="享受自由生活也千万不能忽视暴风军团的威胁。科莱斯平原上无处不在的暴风刺客、暴风逃犯和暴风信使身上带有狄赛奥的信物。请你表现一下你必须具有的能力。小心！在科莱斯平原杀死18级以上的魔物，暴风刺客和暴风逃犯就有可能偷偷出现在你身后。",
        [464]="你参加过大厨师米歇尔的“厨师练习：美味佳肴”吗？很显然，你并不会每次都能成功做出美味佳肴。但即使是失败的作品，也体现了你的劳动成果，具有一定的价值，哪怕仅仅是纪念价值。",
        [465]="你参加过大厨师米歇尔的“厨师练习：美味佳肴”吗？很显然，你并不会每次都能成功做出美味佳肴。但即使是失败的作品，也体现了你的劳动成果，具有一定的价值，哪怕仅仅是纪念价值。",
        [466]="你参加过探险家技能导师厄尔尼诺提供的“练习狩魔”吗？狩魔这项技能专门对付被黑暗侵蚀的怪物，需要一种狩魔宝石作为施法的媒介。完成“练习狩魔”，厄尔尼诺给送给你很多狩魔宝石。嗯，我只需要1颗。",
        [467]="所有绿色品质的武器和防具交到分解师的手里，都可能变成生命、魔法、破坏或者防护微粒，据说这被看成是一种“从有到无”的魔法艺术。我们的生活也需要这样的艺术。",
        [468]="所有绿色品质的武器和防具交到分解师的手里，都可能变成生命、魔法、破坏或者防护微粒，据说这被看成是一种“从有到无”的魔法艺术。我们的生活也需要这样的艺术。",
        [469]="所有绿色品质的武器和防具交到分解师的手里，都可能变成生命、魔法、破坏或者防护微粒，据说这被看成是一种“从有到无”的魔法艺术。我们的生活也需要这样的艺术。",
        [470]="所有绿色品质的武器和防具交到分解师的手里，都可能变成生命、魔法、破坏或者防护微粒，据说这被看成是一种“从有到无”的魔法艺术。我们的生活也需要这样的艺术。",
        [510]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！希望之光图书馆的古籍研究员&pos:(-162,230,-32,1)乔西雅斯·星辉&能够帮助你。",
        [511]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！希望之光图书馆的古籍研究员&pos:(-162,230,-32,1)乔西雅斯·星辉&能够帮助你。",
        [512]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！希望之光图书馆的古籍研究员&pos:(-162,230,-32,1)乔西雅斯·星辉&能够帮助你。",
        [513]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！请在希望之光图书馆里找找看。",
        [515]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [516]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [517]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [518]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [519]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [520]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [521]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [522]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [523]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [524]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [525]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [526]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [527]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [528]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [529]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [530]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [531]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [532]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [533]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [534]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [535]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [536]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [537]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [538]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [539]="各种花草、矿藏和鱼产品给世界增加了自由活泼的色彩。请你去收集一些，为自己的生活也添上一笔颜色。",
        [540]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [541]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [542]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [543]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [544]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [545]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [546]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [547]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [548]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [549]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [550]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [551]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [552]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [553]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [554]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [555]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [556]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [557]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [558]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [559]="炼金术士是一个制造浪漫的职业。请帮我拿回一些炼金药剂，支持炼金术的发展。",
        [565]="这个世界上的吃喝品种还真是丰富啊！如果有一天训练营要举办神魔美食大会的话，不知道会出现哪些奇怪的食物呢？不过现在，先帮我做一些或买一些吃喝吧！",
        [566]="这个世界上的吃喝品种还真是丰富啊！如果有一天训练营要举办神魔美食大会的话，不知道会出现哪些奇怪的食物呢？不过现在，先帮我做一些或买一些吃喝吧！",
        [567]="这个世界上的吃喝品种还真是丰富啊！如果有一天训练营要举办神魔美食大会的话，不知道会出现哪些奇怪的食物呢？不过现在，先帮我做一些或买一些吃喝吧！",
        [568]="这个世界上的吃喝品种还真是丰富啊！如果有一天训练营要举办神魔美食大会的话，不知道会出现哪些奇怪的食物呢？不过现在，先帮我做一些或买一些吃喝吧！",
        [569]="这个世界上的吃喝品种还真是丰富啊！如果有一天训练营要举办神魔美食大会的话，不知道会出现哪些奇怪的食物呢？不过现在，先帮我做一些或买一些吃喝吧！",
        [570]="这个世界上的吃喝品种还真是丰富啊！如果有一天训练营要举办神魔美食大会的话，不知道会出现哪些奇怪的食物呢？不过现在，先帮我做一些或买一些吃喝吧！",
        [580]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [581]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [582]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [583]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [584]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [585]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [586]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [587]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [588]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [589]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [590]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [591]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [592]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [593]="请你制造或者购买一些战备物资交给训练营，我们会把这些物资统一捐赠给市政厅。",
        [610]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！请在暖冬高原的炉火村里找找看。你可以让花街的新手村传送师&pos:(-82,223,-32,1)瑟丽娜&帮你前往炉火村。",
        [611]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！请在暖冬高原的骑士团营地里找找看。你可以让花街的新手村传送师&pos:(-82,223,-32,1)瑟丽娜&帮你前往骑士团营地。",
        [612]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！请在黄昏镇的暮光城堡内找找看。你可以让花街的新手村传送师&pos:(-82,223,-32,1)瑟丽娜&帮你前往暮光城堡。",
        [613]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！请在黄昏镇暮光城堡西面的狼人洞穴里寻找寻找。你可以让花街的新手村传送师&pos:(-82,223,-32,1)瑟丽娜&帮你前往暮光城堡。",
        [614]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！请在避难所的巨岩洞窟里找找看。你可以让花街的新手村传送师&pos:(-82,223,-32,1)瑟丽娜&帮你前往巨岩洞窟。",
        [615]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！请在避难所的精灵村落里找找看。你可以让花街的新手村传送师&pos:(-82,223,-32,1)瑟丽娜&帮你前往奥斯洛村。",
        [616]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！这是一幅画作，据说被某位别墅主人收藏。",
        [617]="现在随处可见的收藏品，将来有可能具有无法估量的价值。请帮我满足下当收藏家的愿望吧！这是一幅画作，据说被某位别墅主人收藏。",
        [650]="听说氏族荣耀的&pos:(-265,219,-113,1)格洛尔尼&会调制一种特制鸡尾酒，希望你能找格格尔尼弄到一杯。当然，欧斯特大陆从来就没有免费的午餐，你懂的。（你需要完成任务：血族食谱）",
        [651]="一些从避难所来到自由港的人带来了一些特殊的战利品：半人马的尾巴。希望你去找下&pos:(-293,219,-74,1)雷吉琼斯&，向他索要一条半人马的尾巴。（你需要完成任务：避难所的机要文件）提醒你一句，避难所港口的&pos:(-229,215,112,10)吉尔·寂城&可以帮你回到自由港。",
        [652]="精灵祭司们有时候会为他们的朋友写一些祝福祷文。亨利没有精灵祭司朋友，希望你帮忙向&pos:(-129,226,82,1)伊露丽&弄一张祷文作为收藏。（你需要完成任务；珍贵的祈祷文书）",
        [653]="听说托托酒馆限量发行了酒馆优惠券，亨利想尽了办法也没能弄到一张，急需你的帮助。你可以让花街的新手村传送师&pos:(-82,223,-32,1)瑟丽娜&帮你前往炉火村，那里的矮人工匠&pos:(187,184,-189,9)哈里&也许有门路。（你需要完成任务：炉火村美酒）给你一份备忘，骑士团营地的&pos:(-190,101,63,9)人族传送师&可以帮你回到自由港。",
        [654]="狮心骑士团最新发行了一种纪念徽章，只有受到嘉奖的骑士团成员才能资格得到。可是喜爱收藏的亨利也想要一个，请你向&pos:(-293,219,-74,1)雷吉琼斯&寻求帮助。（需要完成任务：更新地图）给你一份备忘，骑士团营地的&pos:(-190,101,63,9)人族传送师&可以帮你回到自由港。",
        [670]="训练营需要一份配方：甜蜜梦境，请你一定要帮我找到。有人曾经在道标要塞附近买到了这份配方。",
        [671]="训练营需要一份配方：勇猛药剂，请你一定要帮我找到。有人曾经在迎风回廊附近买到了这份配方。",
        [672]="训练营需要一份食谱：熊肉馅饼，请你一定要帮我找到。有人曾经在迎风回廊附近买到了这份配方。",
        [673]="训练营需要一份食谱：马卡维红酒，请你一定要帮我找到。有人曾经在晨光镇附近买到了这份配方。",
		[680]="自由生活训练营需要一枚魔宠原石，熊、密林之友或者蜘蛛中的任何一种都可以，原石品质要求是“白色”。（如果你能上交一枚绿色品质的原石，将会额外获得一些经验）",
        [681]="自由生活训练营需要一枚魔宠原石，机关人、矮人或者丛林黑豹中的任何一种都可以，原石品质要求是“白色”。（如果你能上交一枚绿色品质的原石，将会额外获得一些经验）",
    }



--xiao 足迹-重复-40级
TaskListTextString[9928] = {
	--1~4
	"旅者岱戈为你推荐了一些工作，完成工作将有可能获得足迹卡片！",
	"我去过很多地方，见识过很多你未曾见到过的风景，我将为你推荐一些工作，当你完成工作的时候，我的那些朋友会送你一张足迹卡片！",
	"我接受。",
	"我对这些工作没有兴趣。"

}

--马戏团新脚本任务需求对话
TaskListTextString[9927] = {
	--1~2
	"        把我的收藏还给我，我会给你们丰厚的奖金。",
	"交还古董。",
	"&$name&在噩梦游乐场内交还古董时，发现了藏在古董中的灵魂树之叶。",

}

--花园修建
TaskListTextString[10368] = {
	--1~5
	"        真高兴看到我们的花园欣欣向荣。你是不是也跟我一样对花花草草格外感兴趣呢？让我们一起为花园做点什么吧！\r\r^006acc任务提示：接受此事务的同时你将会接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、公会资金的增长，以及资源值的提升。",
	"这里是感谢辞。",
	"你是不是也跟我一样对花花草草格外感兴趣呢？让我们一起为花园做点什么吧！！",
	"我愿意效劳！",
	"不，我还有更重要的事情要做。",

	--6~8
	"你已经完成这次公会交给你的事务了吗？",
	"是的。",
	"稍等一下，我还没有完成。",
}

--炼金士修建
TaskListTextString[10369] = {
	--1~5
	"        你不会觉得药剂是种很有趣儿的东西吗？要知道我们的炼金室曾配出过无数种药剂！帮我的忙，炼金室不会亏待你的。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、公会资金的增长，以及资源值的提升。",
	"这里是感谢辞。",
	"你不会觉得药剂是种很有趣儿的东西吗？要知道我们的炼金室曾配出过无数种药剂！帮我的忙，炼金室不会亏待你的！",
	"我愿意效劳！",
	"不，我还有更重要的事情要做。",

	--6~8
	"你已经完成这次公会交给你的事务了吗？",
	"是的。",
	"稍等一下，我还没有完成。",
}

--渔场修建
TaskListTextString[10370] = {
	--1~5
	"        我讨厌猫！当然，我更讨厌那些不劳而获的家伙！咱们的渔场总是需要人搭把手的！那些家伙却总是拿东拿西从不付出！你不是这样的人吧？来！帮我个忙吧。\r\r^006acc任务提示：接受此事务的同时你将会接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、公会资金的增长，以及资源值的提升。",
	"这里是感谢辞。",
	"咱们的渔场总是需要人搭把手的！那些家伙却总是拿东拿西从不付出！你不是这样的人吧？来！帮我个忙吧！",
	"我愿意效劳！",
	"不，我还有更重要的事情要做。",

	--6~8
	"你已经完成这次公会交给你的事务了吗？",
	"是的。",
	"稍等一下，我还没有完成。",
}

--酒吧修建
TaskListTextString[10371] = {
	--1~5
	"        能歇口气喝点什么真是件惬意的事儿啊。看着我干什么？我是说我歇口气儿。你？你当然要帮我跑个腿儿了。不干？那以后就别拿酒吧的东西！\r\r^006acc任务提示：接受此事务的同时你将会接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、公会资金的增长，以及资源值的提升。",
	"这里是感谢辞。",
	"看着我干什么？我是说我歇口气儿。你？你当然要帮我跑个腿儿了。不干？那以后就别拿酒吧的东西！",
	"我愿意效劳！",
	"不，我还有更重要的事情要做。",

	--6~8
	"你已经完成这次公会交给你的事务了吗？",
	"是的。",
	"稍等一下，我还没有完成。",
}

--地质修建
TaskListTextString[10444] = {
	--1~5
	"        只要是在克兰蒙多地底下的东西，没有地质研究协会不知道的。想要珍贵的矿藏消息，就要帮我们干活。\r\r^006acc任务提示：接受此事务的同时你将会接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、公会资金的增长，以及资源值的提升。",
	"这里是感谢辞。",
	"只要是在克兰蒙多地底下的东西，没有地质研究协会不知道的。想要珍贵的矿藏消息，就要帮我们干活！",
	"我愿意效劳！",
	"不，我还有更重要的事情要做。",

	--6~8
	"你已经完成这次公会交给你的事务了吗？",
	"是的。",
	"稍等一下，我还没有完成。",
}

--魔宠修建
TaskListTextString[10445] = {
	--1~5
	"        拿着一颗灵魂原石仔细听的时候，是可以听到它的声音的。想让你的魔宠成长来魔宠修炼室就对了。当然，你也可以顺便帮帮我的忙。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、公会资金的增长，以及资源值的提升。",
	"这里是感谢辞。",
	"拿着一颗灵魂原石仔细听的时候，是可以听到它的声音的。想让你的魔宠成长来魔宠修炼室就对了。当然，你也可以顺便帮帮我的忙。",
	"我愿意效劳！",
	"不，我还有更重要的事情要做。",

	--6~8
	"你已经完成这次公会交给你的事务了吗？",
	"是的。",
	"稍等一下，我还没有完成。",
}

--xiaozhiyu测试脚本任务
TaskListTextString[9445] = {
	[1] = "Would you like to get this task?",
	[2] = "Yes,I'd like.",
	[3] = "Are you ready to complete this task?",
	[4] = "Sure.",
	[5] = "Default broadcast massage.",
	[6] = "Default task tracks",
	[11] = "自由港生活",
	[12] = "学习",
	[13] = "厨师练习",
	[14] = "炼金练习",

}

--个人幸运活动
TaskListTextString[10631] = {
	[1] = "作为自由生活训练营的占星师，我每天会任意推荐一个幸运活动给你。参与这个推荐活动，你将获得额外奖励，还有机会成为今天的幸运之星！",
	[2] = "好，我接受推荐。",
	[3] = "你已经完成了亨利推荐给你的活动？",
	[4] = "是的！",
	[5] = "^ffd700命运星轮缓缓转动，&$name&得到神的眷顾，完成了自由港占星师亨利推荐的个人幸运活动后收获了多倍幸运经验！",
	[6] = "^466e23【绿色幸运】本体经验+20% \r^50210f",
	[7] = "^0000ff【蓝色幸运】本体经验+60% \r^50210f",
	Prefix = "^006acc今日个人幸运：剩余 %d 次\r^50210f",

	[11]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：消耗忘忧果获得经验。在狮心骑士团、山林同盟或者氏族荣耀声望专员处购买赞歌或者赞美诗，使用后即可得到忘忧果。在训练、祈祷或者酒会时间内，忘忧果可以被持续消耗，从而获得额外经验。",
	[12]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：艾西河的亡者。你需要完成5次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[13]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：石料厂的工作。你需要完成5次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[14]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：锻火团的盗墓者。你需要完成5次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[15]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：快渴死的部族遗民。你需要完成3次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[16]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：矮人的朋友。你需要完成5次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[17]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：井水的守护。你需要完成3次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[18]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：灵魂的火焰。你需要完成5次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[19]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：爱神泉的鳄鱼。你需要完成5次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[20]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：小麦克的宝藏。你需要完成5次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[21]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：树上的青年。你需要完成5次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[22]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：避风镇的天空。你需要完成5次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[23]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是野外历练任务：精灵的朋友。你需要完成5次。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[24]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：溢彩流光。你需要找到&pos:(-203,229,-127,1)克瑞斯特&进入流光之地完成日常任务。",
	[25]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：自由港生活！在&pos:(-260,228,-13,1)亨利&处领取这个最有价值的日常任务吧！你需要完成10次。",
	[26]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：石工玫瑰征集。请找到&pos:(-102,217,-105,1)海伦坡&领取这个任务。你需要完成3次。",
	[27]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：钓鱼大赛。钓鱼大赛在每天的几个特定时间段内开放，你需要至少获得60枚钓鱼奖牌。（按U查看日程表里的活动，可以了解怎样参加）",
	[28]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：神之试炼初章。这个副本在每天中午和晚上两个时间段内开放，你需要找到&pos:(-259,0,58,1)圣胡安&进入试炼之间。",
	[29]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：噩梦游乐场。你需要进入噩梦游乐场并完成第4关。噩梦游乐场仅在每周的周二、周四和周六开放。",
	[30]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：帝王谷。你需要通过快速组队系统进入帝王谷副本完成日常任务。（可以按T通过快速组队系统报名进入）",
	[31]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：灯塔。你需要通过快速组队系统进入迷失灯塔副本完成日常任务。（可以按T通过快速组队系统报名进入）",
	[32]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：战神之魂竞技场。你需要通过快速组队系统进入战神之魂竞技场副本完成日常任务。（可以按T通过快速组队系统报名进入）",
	[33]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：天空之城。你需要通过快速组队系统进入天空之城副本完成日常任务。（可以按T通过快速组队系统报名进入）",
	[34]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：先祖外围。你需要通过快速组队系统进入先祖外围副本完成日常任务。（可以按T通过快速组队系统报名进入）",
	[35]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：先祖陵寝。你需要通过快速组队系统进入先祖陵寝副本完成日常任务。（可以按T通过快速组队系统报名）",
	[36]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：自由港引路人。你需要前往希望之光图书馆，找到&pos:(-172,229,-23,1)布克雷&处领取。",
	[37]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：旅者的工作委托。你需要前往锡月林地的荆棘营地，找到岱戈，完成他的任务将获得足迹卡片。",
	[38]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：噩梦游乐场。你需要进入噩梦游乐场并完成第4关。噩梦游乐场仅在每周的周二、周四和周六开放。",
	[39]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：罗拉快跑。你需要找到&pos:(-179,224,91,1)加兰特尔·曼尼&领取任务，将获得星辰碎片的奖励。",
	[40]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：裂隙-荣耀之陵。你需要通过快速组队系统（T）进入这个副本完成日常任务。",
	[41]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：裂隙-阴魂要塞。你需要通过快速组队系统（T）进入这个副本完成日常任务。",
	[42]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：裂隙-阴魂要塞深处。你需要通过快速组队系统（T）进入这个副本完成日常任务。",
	[43]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：裂隙-水之囚笼。你需要通过快速组队系统（T）进入这个副本完成日常任务。",
	[44]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：裂隙-风之高塔。你需要通过快速组队系统（T）进入这个副本完成日常任务。",
	[45]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：裂隙-树之厅堂。你需要通过快速组队系统（T）进入这个副本完成日常任务。",
	[46]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：裂隙-光之圣殿。你需要通过快速组队系统（T）进入这个副本完成日常任务。",
	[47]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：港口危机。港口危机在每天的几个特定时间段内开放，你需要至少获得5枚海军勋章。（按U查看日程表里的活动，可以了解具体时间段）",
	[48]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：溢彩流光。找到&pos:(-203,229,-127,1)克瑞斯特&进入流光之地完成日常任务。",
	[49]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：噩梦游乐场。你需要进入噩梦游乐场。噩梦游乐场仅在每周的周二、周四和周六开放。周六的噩梦游乐场是双倍奖励，一定不要错过。",
	[50]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：栖溪谷。你需要进入栖溪谷副本，在副本内找到魔宠训练师希克斯领取日常任务。",
	[51]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：驯兽练习“喂食宠物”。你需要在林荫公园找到&pos:(-182,225,70,1)驯兽师导师：与风共舞&领取。",
	[52]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：点石成金首轮。持有墨丘利的小雕像和炼金委托书，在&pos:(-234,229,-70,1)墨丘利商会会长克里斯托弗&处领取。",
	[53]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：狩魔练习。你需要找到探险家技能导师&pos:(-290,236,-122,1)厄尔尼诺&领取任务，前提是你先在那里学会狩魔技能。",
	[54]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：堆塔镇的探险家入门。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[55]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：锡月林地的探险家指引。请你前往锡月林地的荆棘营地，找到探险家葛洛萨领取任务。",
	[56]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：锡月林地的探险家任务“最后一个成员”。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[57]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：驯兽练习“喂食宠物”。你需要在林荫公园找到&pos:(-182,225,70,1)驯兽师导师：与风共舞&领取。",
	[58]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：厨师练习“美味佳肴”。你需要找到大厨师&pos:(-121,215,-78,1)米歇尔&领取任务。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[59]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：炼金练习“调和之秘”。你需要找到炼金术士&pos:(-107,215,-63,1)露亚&领取炼金练习的任务。（按U查看日程表里的日常任务，可以了解怎样领取此任务。）",
	[60]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：社交家任务“阅读”。你需要找到&pos:(-266,228,-15,1)里奥&领取任务。",
	[61]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：暗月嗜血者追剿令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，消耗一些活力使用追剿令并完成任务2次。",
	[62]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：食魂魔追剿令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，消耗一些活力使用追剿令并完成任务2次。",
	[63]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：堕落幼龙追剿令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，消耗一些活力使用追剿令并完成任务2次。",
	[64]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：幽魂纳迦追剿令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，消耗一些活力使用追剿令并完成任务2次。",
	[65]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：密林之友追剿令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，消耗一些活力使用追剿令并完成任务2次。",
	[66]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：多头蛇蜥追剿令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，消耗一些活力使用追剿令并完成任务2次。",
	[67]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：巨型蜘蛛追剿令或比尔血盟追剿令。你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买巨型蜘蛛追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买比尔血盟追剿令。使用追剿令并完成任务2次。",
	[68]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：巨魔追剿令或黑矮人矿工追剿令。你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买巨魔追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买黑矮人矿工追剿令。使用追剿令并完成任务2次。",
	[69]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：曙光号危机。曙光号飞艇副本是每天固定时间开放的副本（可以按“U”查看具体时间）。你进入副本，会自动接到“曙光号的危机”的任务，请至少完成它的第一个环节：保护左副舰。",
	[70]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的超级特别推荐事务是：噩梦嘉年华。完成这个超级幸运事务，将比其他事务增加100%的奖励！\n噩梦嘉年华是可以每周参加3次的副本（每周日的0点会重置副本次数），但在本周内每关只能领取一次奖励。你需要参加一次嘉年华，并获得第4关的奖励。",
	[71]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：PVP竞技场。每天第一次进入3v3或者6v6竞技场，都会自动接到竞技场日常任务。你的目标就是完成这项日常任务。",
	[72]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：栖溪谷·不老潭。你需要进入栖溪谷·不老潭副本，在副本内找到魔宠训练师希克斯领取日常任务“狩猎王者”。",
	[73]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：杀人藤追剿令或人类主权同盟追剿令。你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买杀人藤追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买人类主权同盟追剿令。使用追剿令并完成任务2次。",
	[74]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：丛林矮人追剿令或血纹苦修者追剿令。你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买丛林矮人追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买血纹苦修者追剿令。使用追剿令并完成任务2次。",
	[75]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：自由港监狱。你需要通过快速组队系统进入自由港监狱副本完成日常任务。（可以按T通过快速组队系统报名）",
	[76]= "放弃任务后当天无法再次领取，除非使用1次幸运陀螺\r今天的特别推荐事务是：黑地精保镖追剿令。你需要在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买黑地精保镖追剿令。使用追剿令并完成任务2次。",

	[301]= "消耗忘忧果",
	[302]= "艾西河的亡者",
	[303]= "石料厂的工作",
	[304]= "锻火团的盗墓者",
	[305]= "快渴死的部族遗民",
	[306]= "矮人的朋友",
	[307]= "井水的守护",
	[308]= "灵魂的火焰",
	[309]= "爱神泉的鳄鱼",
	[310]= "小麦克的宝藏",
	[311]= "树上的青年",
	[312]= "避风镇的天空",
	[313]= "精灵的朋友",
	[314]= "流光之地",
	[315]= "自由港生活",
	[316]= "石工玫瑰征集",
	[317]= "钓鱼大赛：60枚奖牌",
	[318]= "神之试炼初章",
	[319]= "噩梦游乐场",
	[320]= "帝王谷",
	[321]= "迷失灯塔",
	[322]= "战神之魂",
	[323]= "天空之城",
	[324]= "先祖陵寝外围",
	[325]= "先祖陵寝",
	[326]= "自由港引路人",
	[327]= "旅者的工作委托",
	[328]= "噩梦游乐场",
	[329]= "罗拉快跑",
	[330]= "裂隙：荣耀之陵",
	[331]= "裂隙：阴魂要塞",
	[332]= "裂隙：阴魂深处",
	[333]= "裂隙：水之囚笼",
	[334]= "裂隙：风之高塔",
	[335]= "裂隙：树之厅堂",
	[336]= "裂隙：光之圣殿",
	[337]= "港口危机：5枚勋章",
	[338]= "流光之地",
	[339]= "噩梦游乐场",
	[340]= "栖溪谷修炼",
	[341]= "驯兽练习",
	[342]= "墨丘利的启示录",
	[343]= "狩魔练习",
	[344]= "探险家入门",
	[345]= "探险家的指引",
	[346]= "探险进阶",
	[347]= "驯兽练习",
	[348]= "美味佳肴",
	[349]= "炼金练习",
	[350]= "阅读",
	[351]= "追剿暗月嗜血者",
	[352]= "追剿食魂魔",
	[353]= "追剿堕落幼龙",
	[354]= "追剿幽魂纳迦",
	[355]= "追剿密林之友",
	[356]= "追剿多头蛇蜥",
	[357]= "追剿巨型蜘蛛或比尔血盟刺客",
	[358]= "追剿巨魔或黑矮人矿工",
	[359]= "曙光号危机：保护左副舰",
	[360]= "超级幸运！嘉年华！",
	[361]= "完成1场竞技场",
	[362]= "栖溪谷狩猎王者",
	[363]= "追剿杀人藤或人类主权同盟精英",
	[364]= "追剿丛林矮人或血纹苦修者",
	[365]= "自由港监狱",
	[366]= "追剿黑地精保镖",
}

--世界幸运活动 - 太阳神
TaskListTextString[10763] =	{
	talk_to_give = "克兰蒙多大陆的命运星轮在永不停歇地转动着，每天固定给人们带来两项幸运事件。其中一项是象征正相星盘的[太阳神索尔的赐福]，太阳神索尔挑选了一个活动作为今天的世界幸运活动之一。如果你能完成，将可以收获高额的经验，还有机会成为今天的幸运之星！你愿意参加吗？",
	give_task = "好，我愿意参加今天的世界幸运活动。",
	talk_to_complete = "那么，实际上你已经完成了世界幸运活动[太阳神索尔的赐福]。升腾的希望之光，与你同行。",
	complete_task = "与我们同行！",
	broadcast = "^ffd700命运星轮缓缓转动，&$name&完成了世界幸运活动，领受到了来自太阳神索尔的阳光祝福，获得多倍幸运经验！",

	[1]= "找到社交学者&pos:(-266,228,-15,1)里奥&，如果你是潇洒的男士，请先完成“闻香识女人”任务；如果你是漂亮的女士，请先完成“香水师”任务。然后，女士做队长邀请一位男士做队友，使用手中的香水吧！接着，男士领取“女人香”任务，根据女士的香水类型选择相应选项完成任务。最后一步很重要，需要男士把得到的礼物送给女士。请男士发扬绅士精神，主动跑到女士身边！",
	[2]= "首先你要是一位公会的成员（包括新手公会），在公会首席建设官&pos:(-183,228,-119,1)杰西卡&那里完成“公会活动：募捐”。这个任务需要你上交副职业的产品。",
	[3]= "栖溪谷副本是捕捉优秀魔宠、提升魔宠经验和搜罗魔宠技能的好地方。你需要找到副本里的魔宠修炼师希克斯领取并完成”栖溪谷修炼“任务。",
	[4]= "流光之地副本是搜罗各种珍贵宝石和地方。你进入副本后，会自动接到“流光之地”任务。完成这个任务，一颗宝石就一定是属于你的了！",
	[5]= "自由港的大厨师&pos:(-121,215,-78,1)米歇尔&每天都会提供厨师练习的任务，这是一件非常容易做的事情。如果你运气好，还能得到他赠与的珍稀食谱和特效食品。",
	[6]= "自由港的炼金术士&pos:(-107,215,-63,1)露亚&每天都会提供炼金练习的任务，据说可以锻炼手眼协调能力。如果你运气好，还能得到她赠与的梦境配方和梦境饮品。",
	[7]= "自由港的钓鱼大赛在每天固定时间开放（可以按“U”查看具体时间）。请按时前往&pos:(-220,208,-193,1)大眼努森&处参加，给你的最低要求是赢得60枚钓鱼奖牌。",
	[8]= "暴风军团小股部队持续在自由港外海进行骚扰，平静的港口仍然时时充满危机（可以按“U”查看港口危机的具体时间）。请准时前往&pos:(-25,216,-69,1)吉尔·寂城&处解决港口危机，给你的最低要求是赢得5枚海战勋章。",
	[9]= "希望之光图书馆的&pos:(-172,229,-23,1)布克雷&是一位光影引导者，他有自己独特的方式让你熟悉自由港这座伟大的城市，还将把一张足迹卡片留给完成“自由港引路人”任务的人。",
	[10]= "罗拉是一位善跑的精灵女战士。作为罗拉非常好的朋友，&pos:(-179,224,91,1)加兰特尔·曼尼&，希望每天都有人陪罗拉一起跑步，既不能太快，也不能太慢。你能做到吗？是的，你今天最少需要跑赢罗拉2次。",
	[11]= "自由港林荫公园的驯兽师导师&pos:(-182,225,70,1)与风共舞&准备了有趣的喂食宠物的练习，你可以去试试看。如果你是一名驯兽师，你所喂食的宠物还能得到可观的经验。",
	[12]= "曙光号飞艇副本是每天固定时间开放的副本（可以按“U”查看具体时间）。你进入副本后，会自动接到“曙光号的危机”的任务，请至少完成它的第一个环节：保护左副舰。",
	[13]= "向往激情，拒绝平淡，请参加pvp竞技场。你需要通过自动组队系统（T）报名参加3v3或者6v6竞技场。每天第一次进入竞技场，会接到日常任务，你需要完成它。",
	[14]= "栖溪谷·不老潭副本是捕捉优秀魔宠、提升魔宠经验和搜罗魔宠技能的好地方。你需要找到副本里的魔宠修炼师希克斯领取并完成”狩猎王者“的每日修炼任务。",
	[15]= "完成这个超级幸运事务，将比其他事务增加100%的奖励！\n噩梦嘉年华是可以每周参加3次的副本（每周日的0点会重置副本次数），但在本周内每关只能领取一次奖励。你需要参加一次嘉年华，并获得第4关的奖励。",
	[100]= "你需要通过自动组队系统（T）进入副本“裂隙：荣耀之陵”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[101]= "你需要通过自动组队系统（T）进入副本“裂隙：阴魂要塞”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[102]= "你需要通过自动组队系统（T）进入副本“裂隙：阴魂深处”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[103]= "你需要通过自动组队系统（T）进入副本“裂隙：水之囚笼”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[104]= "你需要通过自动组队系统（T）进入副本“裂隙：风之高塔”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[105]= "你需要通过自动组队系统（T）进入副本“裂隙：树之厅堂”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[106]= "你需要通过自动组队系统（T）进入副本“裂隙：光之圣殿”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[110]= "道标要塞副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[111]= "帝王谷副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[112]= "迷失灯塔副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[113]= "战神之魂副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[114]= "天空之城副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[115]= "先祖陵寝外围副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[116]= "先祖陵寝副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[117]= "自由港监狱副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[130]= "这个任务来自于铁鳄武士追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[131]= "这个任务来自于暗月嗜血者追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[132]= "这个任务来自于食魂魔追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[133]= "这个任务来自于堕落幼龙追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[134]= "这个任务来自于幽魂纳迦追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[135]= "这个任务来自于密林之友追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[136]= "这个任务来自于多头蛇蜥追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[137]= "你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买巨型蜘蛛追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买比尔血盟追剿令。使用追剿令并完成任务2次。",
	[138]= "你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买巨魔追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买黑矮人矿工追剿令。使用追剿令并完成任务2次。",
	[139]= "你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买杀人藤追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买人类主权同盟追剿令。使用追剿令并完成任务2次。",
	[140]= "你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买丛林矮人追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买血纹苦修者追剿令。使用追剿令并完成任务2次。",
	[141]= "你需要在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买黑地精追剿令。使用追剿令并完成任务2次。",

	[501]= "魅力女人香",
	[502]= "公会募捐",
	[503]= "栖溪谷修炼",
	[504]= "流光之地",
	[505]= "厨师练习：美味佳肴",
	[506]= "炼金练习：调和之秘",
	[507]= "钓鱼大赛：60枚奖牌",
	[508]= "港口危机：5枚勋章",
	[509]= "自由港引路人",
	[510]= "和罗拉赛跑",
	[511]= "驯兽练习：喂食宠物",
	[512]= "曙光号危机：保护左副舰",
	[513]= "完成1场竞技场",
	[514]= "栖溪谷狩猎王者",
	[515]= "超级幸运！嘉年华！",
	[600]= "裂隙：荣耀之陵",
	[601]= "裂隙：阴魂要塞",
	[602]= "裂隙：阴魂深处",
	[603]= "裂隙：水之囚笼",
	[604]= "裂隙：风之高塔",
	[605]= "裂隙：树之厅堂",
	[606]= "裂隙：光之圣殿",
	[610]= "道标要塞",
	[611]= "帝王谷",
	[612]= "迷失灯塔",
	[613]= "战神之魂",
	[614]= "天空之城",
	[615]= "先祖陵寝外围",
	[616]= "先祖陵寝",
	[617]= "自由港监狱",
	[630]= "追剿铁鳄武士",
	[631]= "追剿暗月嗜血者",
	[632]= "追剿食魂魔",
	[633]= "追剿堕落幼龙",
	[634]= "追剿幽魂纳迦",
	[635]= "追剿密林之友",
	[636]= "追剿多头蛇蜥",
	[637]= "追剿巨型蜘蛛或比尔血盟刺客",
	[638]= "追剿巨魔或黑矮人矿工",
	[639]= "追剿杀人藤或人类主权同盟精英",
	[640]= "追剿丛林矮人或血纹苦修者",
	[641]= "追剿黑地精保镖",
}

--世界幸运活动 -- 月神
TaskListTextString[10764] =	{
	talk_to_give = "克兰蒙多大陆的命运星轮在永不停歇地转动着，每天固定给人们带来两项幸运事件。其中一项是象征逆相星盘的[月神缇拉的赐福]，月神缇拉挑选了一个活动作为今天的世界幸运活动。如果你能完成，将可以收获高额的经验，还有机会成为今天的幸运之星！你愿意参加吗？",
	give_task = "好，我愿意参加今天的世界幸运活动。",
	talk_to_complete = "那么，实际上你已经完成了世界幸运活动[月神缇拉的赐福]。即使你遇到多少阴险顽固的拦路石头，月神缇拉都会帮你度过难关。",
	complete_task = "我愿意相信！",
	broadcast = "^ffd700命运星轮缓缓转动，&$name&完成了世界幸运活动，领受到了来自月神缇拉的辉光祝福，获得多倍幸运经验！",

	[1]= "找到社交学者&pos:(-266,228,-15,1)里奥&，如果你是潇洒的男士，请先完成“闻香识女人”任务；如果你是漂亮的女士，请先完成“香水师”任务。然后，女士做队长邀请一位男士做队友，使用手中的香水吧！接着，男士领取“女人香”任务，根据女士的香水类型选择相应选项完成任务。最后一步很重要，需要男士把得到的礼物送给女士。请男士发扬绅士精神，主动跑到女士身边！",
	[2]= "首先你要是一位公会的成员（包括新手公会），在公会首席建设官&pos:(-183,228,-119,1)杰西卡&那里完成“公会活动：募捐”。这个任务需要你上交副职业的产品。",
	[3]= "栖溪谷副本是捕捉优秀魔宠、提升魔宠经验和搜罗魔宠技能的好地方。你需要找到副本里的魔宠修炼师希克斯领取并完成”栖溪谷修炼“任务。",
	[4]= "流光之地副本是搜罗各种珍贵宝石和地方。你进入副本后，会自动接到“流光之地”任务。完成这个任务，一颗宝石就一定是属于你的了！",
	[5]= "自由港的大厨师&pos:(-121,215,-78,1)米歇尔&每天都会提供厨师练习的任务，这是一件非常容易做的事情。如果你运气好，还能得到他赠与的珍稀食谱和特效食品。",
	[6]= "自由港的炼金术士&pos:(-107,215,-63,1)露亚&每天都会提供炼金练习的任务，据说可以锻炼手眼协调能力。如果你运气好，还能得到她赠与的梦境配方和梦境饮品。",
	[7]= "自由港的钓鱼大赛在每天固定时间开放（可以按“U”查看具体时间）。请按时前往&pos:(-220,208,-193,1)大眼努森&处参加，给你的最低要求是赢得60枚钓鱼奖牌。",
	[8]= "暴风军团小股部队持续在自由港外海进行骚扰，平静的港口仍然时时充满危机（可以按“U”查看港口危机的具体时间）。请准时前往&pos:(-25,216,-69,1)吉尔·寂城&处解决港口危机，给你的最低要求是赢得5枚海战勋章。",
	[9]= "希望之光图书馆的&pos:(-172,229,-23,1)布克雷&是一位光影引导者，他有自己独特的方式让你熟悉自由港这座伟大的城市，还将把一张足迹卡片留给完成“自由港引路人”任务的人。",
	[10]= "罗拉是一位善跑的精灵女战士。作为罗拉非常好的朋友，&pos:(-179,224,91,1)加兰特尔·曼尼&，希望每天都有人陪罗拉一起跑步，既不能太快，也不能太慢。你能做到吗？是的，你今天最少需要跑赢罗拉2次。",
	[11]= "自由港林荫公园的驯兽师导师&pos:(-182,225,70,1)与风共舞&准备了有趣的喂食宠物的练习，你可以去试试看。如果你是一名驯兽师，你所喂食的宠物还能得到可观的经验。",
	[12]= "曙光号飞艇副本是每天固定时间开放的副本（可以按“U”查看具体时间）。你进入副本后，会自动接到“曙光号的危机”的任务，请至少完成它的第一个环节：保护左副舰。",
	[13]= "向往激情，拒绝平淡，请参加pvp竞技场。你需要通过自动组队系统（T）报名参加3v3或者6v6竞技场。每天第一次进入竞技场，会接到日常任务，你需要完成它。",
	[14]= "栖溪谷·不老潭副本是捕捉优秀魔宠、提升魔宠经验和搜罗魔宠技能的好地方。你需要找到副本里的魔宠修炼师希克斯领取并完成”狩猎王者“的每日修炼任务。",
	[15]= "完成这个超级幸运事务，将比其他事务增加100%的奖励！\n噩梦嘉年华是可以每周参加3次的副本（每周日的0点会重置副本次数），但在本周内每关只能领取一次奖励。你需要参加一次嘉年华，并获得第4关的奖励。",
	[100]= "你需要通过自动组队系统（T）进入副本“裂隙：荣耀之陵”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[101]= "你需要通过自动组队系统（T）进入副本“裂隙：阴魂要塞”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[102]= "你需要通过自动组队系统（T）进入副本“裂隙：阴魂深处”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[103]= "你需要通过自动组队系统（T）进入副本“裂隙：水之囚笼”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[104]= "你需要通过自动组队系统（T）进入副本“裂隙：风之高塔”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[105]= "你需要通过自动组队系统（T）进入副本“裂隙：树之厅堂”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[106]= "你需要通过自动组队系统（T）进入副本“裂隙：光之圣殿”，完成自动接到的日常任务。裂隙副本是时空裂隙的投影，那里的魔物死后会爆出大量的xp魂，更有机会得到“裂纹水晶”，凭借水晶可以进入真实世界之地下城。",
	[110]= "道标要塞副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[111]= "帝王谷副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[112]= "迷失灯塔副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[113]= "战神之魂副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[114]= "天空之城副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[115]= "先祖陵寝外围副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[116]= "先祖陵寝副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[117]= "自由港监狱副本是冒险者们提升自己装备的必要去处，需要队友之间的默契配合才能取得最终的胜利。你需要通过快速组队系统（T）进入副本，完成自动接到的日常任务。",
	[130]= "这个任务来自于铁鳄武士追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[131]= "这个任务来自于暗月嗜血者追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[132]= "这个任务来自于食魂魔追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[133]= "这个任务来自于堕落幼龙追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[134]= "这个任务来自于幽魂纳迦追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[135]= "这个任务来自于密林之友追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[136]= "这个任务来自于多头蛇蜥追缴令。你需要找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买指定的2个追剿令，使用追剿令并完成任务2次。",
	[137]= "你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买巨型蜘蛛追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买比尔血盟追剿令。使用追剿令并完成任务2次。",
	[138]= "你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买巨魔追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买黑矮人矿工追剿令。使用追剿令并完成任务2次。",
	[139]= "你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买杀人藤追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买人类主权同盟追剿令。使用追剿令并完成任务2次。",
	[140]= "你需要在自由港找到探险家行会的&pos:(-209,228,-45,1)瑞卡拉&购买丛林矮人追剿令，或在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买血纹苦修者追剿令。使用追剿令并完成任务2次。",
	[141]= "你需要在雷辛格找到&pos:(-355,284,-302,26)雷蒙·托尔&购买黑地精追剿令。使用追剿令并完成任务2次。",

	[501]= "魅力女人香",
	[502]= "公会募捐",
	[503]= "栖溪谷修炼",
	[504]= "流光之地",
	[505]= "厨师练习：美味佳肴",
	[506]= "炼金练习：调和之秘",
	[507]= "钓鱼大赛：60枚奖牌",
	[508]= "港口危机：5枚勋章",
	[509]= "自由港引路人",
	[510]= "和罗拉赛跑",
	[511]= "驯兽练习：喂食宠物",
	[512]= "曙光号危机：保护左副舰",
	[513]= "完成1场竞技场",
	[514]= "栖溪谷狩猎王者",
	[515]= "超级幸运！嘉年华！",
	[600]= "裂隙：荣耀之陵",
	[601]= "裂隙：阴魂要塞",
	[602]= "裂隙：阴魂深处",
	[603]= "裂隙：水之囚笼",
	[604]= "裂隙：风之高塔",
	[605]= "裂隙：树之厅堂",
	[606]= "裂隙：光之圣殿",
	[610]= "道标要塞",
	[611]= "帝王谷",
	[612]= "迷失灯塔",
	[613]= "战神之魂",
	[614]= "天空之城",
	[615]= "先祖陵寝外围",
	[616]= "先祖陵寝",
	[617]= "自由港监狱",
	[630]= "追剿铁鳄武士",
	[631]= "追剿暗月嗜血者",
	[632]= "追剿食魂魔",
	[633]= "追剿堕落幼龙",
	[634]= "追剿幽魂纳迦",
	[635]= "追剿密林之友",
	[636]= "追剿多头蛇蜥",
	[637]= "追剿巨型蜘蛛或比尔血盟刺客",
	[638]= "追剿巨魔或黑矮人矿工",
	[639]= "追剿杀人藤或人类主权同盟精英",
	[640]= "追剿丛林矮人或血纹苦修者",
	[641]= "追剿黑地精保镖",
}
--世界之树的嫩枝
TaskListTextString[11265] = {
	DeliverTaskTalk_npc = "        世界之树带给我们新生的希望，克兰蒙多的生灵们矢志不渝的相信那是一切命运的主宰。\r       “世界之树日”是冬赐双节重要的组成部分，每一个感受过世界之树气息的人都将会得到来年一年的好运气，你想加入到感受世界树气息的活动中吗？",
	DeliverTaskTalk_player = "我当然愿意。",

	AwardTalk_npc = "        感染了世界树神圣生命力的你，将拥有一年的好运气！",
	AwardTalk_player = "谢谢你的祝福。",

	[1] ="        欢迎参加世界树之日的庆典活动，这是一枚由克兰蒙多植物学研究会提供的世界树种子。\r        在辛图拉大陆避难所的奥斯洛村南岸，有一棵顶端盘旋着水晶的树，到&pos:(-214,211,-226,10)树下&种下这枚“神秘的种子”，水晶的力量将会催生种子发芽，几乎不用等待，你就可以得到一支嫩芽，摘下来将它带回来给我。\r        愿新的一年好运环绕着你！\r\r                        ——浅浅渊·星辉",
	[2] ="        欢迎参加世界树之日的庆典活动，这是一枚由“石工玫瑰”提供的订制指环“鲜血之刺”。\r        在黄昏镇的余晖墓地，有一个狭窄的&pos:(-13,128,194,11)石质洞穴&，传说众神之战中焰火舞者曾经在那里疗伤，并将世界之树的种子留在了那里。用这枚订制的消毒戒指上的尖刺引导出你身体的血液，并将它滴灌到石穴的土中，嫩芽就会破土而出，摘下来将它带回来给我。\r        愿新的一年好运环绕着你！\r\r                        ——浅浅渊·星辉",
	[3] ="        欢迎参加世界树之日的庆典活动，这是一个由“石工玫瑰”提供的宠物捕捉笼。\r        在破冰河西岸的&pos:(-51,81,182,9)河畔花园&捕捉一只野生的兔子，并将它带给骑士团营地的&pos:(-153,102,46,9)喀秋莎&，相信她会很乐意将她的世界树之芽传递给你。将它带回来给我，你的传递就完成了。\r        愿新的一年好运环绕着你！\r\r                        ——浅浅渊·星辉 ",


}
--圣诞节许愿卡
TaskListTextString[11303] = {
	DeliverTaskTalk_npc = "        暖冬高原真是个好地方，我已经没法数清有多少人在这里许过愿了，我曾经在许愿树底下挖到过几大包陈年的许愿卡片。\r        呃，你看起来对这些来自“名人”的许愿卡很好奇，如果你帮我做一些事情，也许我会给你一点东西，呃，比如说那些名人曾经留下来的许愿卡片。",
	DeliverTaskTalk_player = "成交。",

	AwardTalk_npc = "我就从我的卡片袋里随便摸一张给你吧，千万不要传阅！",
	AwardTalk_player = "好吧……",

	[1] ="        总有一些奇怪的法师们在因为莫名其妙的目的而做着一些事情，比如把一些好好的植物给石化掉。在避雪谷地一些蘑菇下的&pos:(210,110,35,9)水晶&具有神奇的再生力量，可以解除那些石化的诅咒，但是那些水晶能量必须得用这个“水晶能量引导器”来激发，现在需要你做的就是消除那些&pos:(-204,102,-40,9)石化的诅咒&，给那些植物以新生。\r        愿神灵能实现你今年的愿望！\r\r                        ——F·L·W",
	[2] ="        昨天克兰蒙多植物协会的理事们来找我帮忙，说他们发现破冰河沿岸的很多植物都被封在了冰里。虽然说这是冬天常有的事情，但是他们看起来似乎十分紧急。\r        不过据说那是一种奇怪的&pos:(-26,86,-156,9)沉睡之冰&，只有用符能火焰才能融化它。而植物学家们不去自己解决这个问题的原因是符能火焰其实是潜藏在南郊密林&pos:(-142,82,-185,9)火焰领主&的晶核，那些手无缚鸡之力的人们根本无法战胜它。\r        在这个神灵赐福的日子里，我们无论如何都得帮助他们一下。\r        愿你的热心和善良能感动神！\r\r                        ——F·L·W",


}
--噩梦游乐场续 第一关发奖
TaskListTextString[11418] = {
	"        康特尔是我们这里下棋下得最好的人，因为他悔棋的次数最多。\r        我会根据你们完成游戏的成绩，给予你们奖励。",
	"领取奖励。",
}
--噩梦游乐场续 第二关发奖
TaskListTextString[11419] = {
	"        也许有些人对维普的爱好有些看法，不过我们这里才不会管他，这里多的是有奇特爱好的家伙。\r        我会根据你们完成游戏的成绩，给予你们奖励。",
	"领取奖励。",
}
--噩梦游乐场续 第三关发奖
TaskListTextString[11420] = {
	"        希望你不要给自己的宠物或孩子起一些奇怪的名字。\r        我会根据你们完成游戏的成绩，给予你们奖励。",
	"领取奖励。",
}
--噩梦游乐场续 第四关发奖
TaskListTextString[11421] = {
	"        我最讨厌乌龟了！\r        根据你完成游戏的成绩，给予你奖励。",
	"领取奖励。",
	"&$name&在噩梦嘉年华中面对奥依拉姆的挑战时，华丽的起跳，响起一片喝彩，获得灵魂树之叶。",
}
--试炼补偿
TaskListTextString[11417] = {
	broadcast = "^ffff00神之试炼的可进入次数是： ",
}
--公会基地商城物品快捷完成基地任务并捐资金
TaskListTextString[11757] = {
	"公会基地的建设需要大量资金，你愿意把你持有的龙纹珠贝这样的古董捐赠给公会，增加公会资金吗？如果你这样做，我们会视同你已经完成了今天的1轮基地建设任务，可以直接领取对踊跃者的奖励了。",
	"我愿意捐赠！",
}
--沉睡丛林探险家主任务：伟大的旅程
TaskListTextString[12244] = {
	DeliverTalkNpc = "        我的朋友，非常高兴在沉睡丛林看到你，作为一名探险家，你即将在这里踏上伟大的旅程，组建你的探险队，寻找那些隐藏在丛林深处的珍宝，或者竭尽全力满足收藏家尼斯特的请求。",
	DeliverTalkPlayer = "无论如何，那孜孜不倦的，对于未知的感叹和敬意，铭刻在我们卑微的内心之中。",
	AwardTalkNpc = "        我的朋友，祝贺你取得的成就，记住，在丛林漫步的时候，在遗迹探索的时候，在古城挖掘的时候，在深海遨游的时候，我们与你同在，探索的心，与你同在。",
	AwardTalkPlayer = "继续努力吧！朝着下一个伟大的旅程。",
	CompleteTaskExplo = "完成沉睡丛林的探险",
	CompleteTaskFootstep = "完成尼斯特的请求",
	BroadCast = "",
	[0] ="        沉睡丛林的大探险家哥伦布，正在等待着下一位伟大探险家的出现，也许就是你！",
	[1] ="        放弃任务需要30分钟后才能再次领取。\r\r你完成探险家哥伦布的委托：沉睡丛林的探险。",
	[2] ="        放弃任务需要30分钟后才能再次领取。\r\r你需要完成收藏家尼斯特的请求。",

}

--灾域虚空－武器01.FayeS
TaskListTextString[12641] = {

	[1] = "        如果要重塑这把武器的光华，我们需要一种叫做“灾域之刃”的东西。这是将“虚灵精华”加工之后的产物，只有卓越的武器师们能够制造它。\r\r^006acc任务提示：虚灵精华由灾域虚空的隐藏BOSS死亡后掉落。",
	[2] = "        无知的孩子啊，看看你手中的武器，你把它当做破烂？当做废铁？\r        如果你真的这么想，我只能嘲笑你的愚蠢，那是一柄不可多得的武器，只是它的光芒被完全的遮盖住了。我不忍心看它如此，我要帮助你重塑这柄武器的力量。",
	[3] = "它真的不是普通的废铜烂铁？请告诉我该怎么做。",
	[4] = "不错，就是这件东西，现在让我们来充能你的武器。",
	[5] = "谢谢。",
}

--灾域虚空－武器03.FayeS
TaskListTextString[12650] = {

	[1] = "        鲜血的能量蠢蠢欲动，生命的光华冉冉升起，你将见证奇迹的诞生。",
	[2] = "        将你的武器交给我，你马上就可以看到奇迹的出现。",
	[3] = "我拭目以待。",
	[4] = "不错，就是这件东西",
	[5] = "谢谢。",

	[6] = "升华武器：破损的杀星 ",
	[7] = "升华武器：破损的无畏者 ",
	[8] = "升华武器：破损的瘟杀 ",
	[9] = "升华武器：破损的致死-F ",
	[10] = "升华武器：破损的预言 ",
	[11] = "升华武器：破损的神谕 ",
	[12] = "升华武器：破损的残血 ",
	[13] = "升华武器：破损的灾音 ",


	[14]= "鲜血的能量蠢蠢欲动，生命的光华冉冉升起，你将见证奇迹的诞生。",
}

--灾域虚空－帽子01.FayeS
TaskListTextString[12666] = {

	[1] = "        这顶残破的帽子来自灾域虚空——也许它在你眼里并不残破，那只是因为你只是看到它的表面。碧蓝之翼曾经派遣专门的探险队到达过那里，并且留下了相当丰富的资料。\r        如果要赋予这顶帽子真正的能量，我们需要一种叫做“灾域之辉”的东西。这是将“虚灵符能”加工之后的产物，只有卓越的防具师们能够制造它。\r\r^006acc任务提示：虚灵符能由灾域虚空的隐藏BOSS死亡后掉落。",
	[2] = "        这顶帽子看起来不错，但是你不觉得它缺失了一点什么吗？\r        呵呵，它只是徒有其表而缺失了能量的灵魂，也许我可以帮你弥补这个缺陷，你需要我的帮助吗？",
	[3] = "当然，请告诉我该怎么做。",
	[4] = "        不错，就是这件东西，现在让我们来修补你的帽子。",
	[5] = "谢谢。",
}

--灾域虚空－帽子03.FayeS
TaskListTextString[12668] = {

	[1] = "        我们已经做好了全部的准备工作，将你的帽子交给我，擦亮双眼，奇迹即将发生。",
	[2] = "        我们已经做好了全部的准备工作，将你的帽子交给我，擦亮双眼，奇迹即将发生。",
	[3] = "我拭目以待。",
	[4] = "        如何？它是不是看起来光华绚烂?",
	[5] = "谢谢。",

	[6] = "洗礼：破损的蛮野觉醒 ",
	[7] = "洗礼：破损的奥托之冠 ",
	[8] = "洗礼：破损的猛毒之吻 ",
	[9] = "洗礼：破损的狙杀者的窥视 ",
	[10] = "洗礼：破损的元素的兆示 ",
	[11] = "洗礼：破损的悲悯者面具 ",
	[12] = "洗礼：破损的血泪之痕 ",
	[13] = "洗礼：破损的悲泣聆听者 ",

	[14]= "能量在上空盘旋，注入你的帽子。",
}

--灾域虚空－护肩01.FayeS
TaskListTextString[12669] = {

	[1] = "        你用暴风石换来的肩膀看起来不错，但始终不够完美。碧蓝之翼曾经派遣专门的探险队到达过灾域虚空，并且留下了相当丰富的资料。\r        如果要赋予这个护肩真正的能量，我们需要一种叫做“灾域之舞”的东西。这是将“虚灵晶粒”加工之后的产物，只有卓越的防具师们能够制造它。\r\r^006acc任务提示：虚灵晶粒由灾域虚空的隐藏BOSS死亡后掉落。",
	[2] = "        你用暴风石换来的肩膀看起来不错，但始终不够完美，也许我可以帮你修复它。",
	[3] = "请告诉我该怎么做。",
	[4] = "不错，就是这件东西，现在让我们来修补你的护肩。",
	[5] = "谢谢。",
}

--灾域虚空－护肩03.FayeS
TaskListTextString[12671] = {

	[1] = "灵魂的光辉即将注入你的护肩，舞神的祝福与你同在。",
	[2] = "        擦亮双眼，你将看到灵魂的光彩。",
	[3] = "我拭目以待。",
	[4] = "...",
	[5] = "完成任务3",

	[6] = "灵魂注入：破损的狂暴之壳 ",
	[7] = "灵魂注入：破损的逝者的希望 ",
	[8] = "灵魂注入：破损的氤氲之影 ",
	[9] = "灵魂注入：破损的伪装下的杀机 ",
	[10] = "灵魂注入：破损的占星者之夜 ",
	[11] = "灵魂注入：破损的仁慈的安抚 ",
	[12] = "灵魂注入：破损的黯淡血光 ",
	[13] = "灵魂注入：破损的噩运的前奏 ",

	[14]= "灵魂的光辉即将注入你的护肩，舞神的祝福与你同在。",
}

--四季合唱团-嘉铭,
TaskListTextString[12635] = {
	DeliverTalkNpc = "        整天忙忙碌碌的，从东唱到西，从天说到地，连满足自己小小愿望的时间都没有。你愿意帮我吗？\r（6月6日19：00~6月9日20：00期间可领取任务）",
	DeliverTalkPlayer = "如果需要我帮忙的话。",
	AwardTalkNpc = "complete",
	AwardTalkPlayer = "complete",
	Broadcast = "&$name& 与四季合唱团达成了1次完美的共鸣，总计获得了 %d 次。",
	SubmitItemText = "满足嘉铭的愿望",
	SubmitItemPrologue = "    我希望神能听到我的赞美并给我力量，这样我再参加骑士团工作时才能获得声望。\r    我希望骑士团能对我更大方点，首先是他们特制的烤肉，最好能让我随时就能享用。\r    我希望吃烤肉的时候还能痛饮一顿，特别是带有古老沙漠味道的传统酒多么令人难忘。\r    我希望平民也能在对抗暴风军团的战役中展现价值，即使最朴素的宝石也可以闪光。",
	Description = "把嘉铭·福尔岱希望得到的四样物品交给他，将会得到他的感谢。如果你能按照他心目中正确的顺序交给他，将会获得一次“完美的共鸣”，并得到更多的奖励。"
}
--四季合唱团-真真,
TaskListTextString[12634] = {
	DeliverTalkNpc = "        真真姑娘是我们合唱团的小妹，我几乎从来都不欺负她。她也有4个愿望，我请求你去帮助她。\r（6月9日19：00~6月12日20：00期间可领取任务）",
	DeliverTalkPlayer = "没问题。",
	AwardTalkNpc = "complete",
	AwardTalkPlayer = "complete",
	Broadcast = "&$name& 与四季合唱团达成了1次完美的共鸣，总计获得了 %d 次。",
	SubmitItemText = "满足真真的愿望",
	SubmitItemPrologue = "    听说遥远王国的王子大婚，浪漫的“阳台之吻”是经典仪式，我能不能也想象一下？\r    在众人的仰望和欢呼中携手而对视，这难道不是像彩虹一样绚烂的甜蜜？\r    只要拥有过“热烈的爱”，红得像火焰一样热烈的爱，平凡人的一生也无怨无悔。\r    一颗没经过精雕细琢的钻石，谁说它就一定不能散发出超然的光彩？",
	Description = "把真真·吉奇拜希望得到的四样物品交给她，将会得到她的感谢。如果你能按照她心目中正确的顺序交给她，将会获得一次“完美的共鸣”，并得到更多的奖励。"
}
--四季合唱团-炀羽,
TaskListTextString[12636] = {
	DeliverTalkNpc = "        炀羽大哥辛辛苦苦地带着我们在克兰蒙多大陆到处边走边唱，忽略了种种个人问题。你最好也帮助他满足下愿望吧！\r（6月12日19：00~6月17日0：00期间可领取任务）",
	DeliverTalkPlayer = "非常乐意。",
	AwardTalkNpc = "complete",
	AwardTalkPlayer = "complete",
	Broadcast = "&$name& 与四季合唱团达成了1次完美的共鸣，总计获得了 %d 次。",
	SubmitItemText = "满足炀羽的愿望",
	SubmitItemPrologue = "    假如我白天可以做梦，我希望能梦见一位散发着谜一般的香气的女人。\r    假如那女人能感受到我的爱，我希望那是一场心灵的碰撞与赞美，就像对神的赞美。\r    假如碰撞之后给克兰蒙多带来了新的能量，我希望那是智者的能量。\r    假如智慧能像以往那样扑到我身上，我希望能赐予我一道永远解不开的谜题。",
	Description = "把炀羽·威索南希望得到的四样物品交给他，将会得到他的感谢。如果你能按照他心目中正确的顺序交给他，将会获得一次“完美的共鸣”，并得到更多的奖励。"
}

--武器师日常活动.FayeS
TaskListTextString[12760] = {

	DescriptionText = {
		[0] = { [0] = "        自由港工匠之家的哈撒娜米·影尘能够帮助你提升你的武器师技艺。",},
		[1] = {	[1] = " 你需要向哈撒娜米展示你当前“武器师”等级可以制造的优秀/精良品质武器。\r\r^006acc任务提示：展示的作品不会被哈撒娜米私自留下。",},
		[2] = {
				[40] = "        狄赛奥入侵之后，很多生物发生了变异而魔化。经过这些魔物身体的影响，钢锭会呈现一种特别的状态，我们叫它魔化钢锭。我和我的同伴曾经将大量的钢锭微粒植入各种魔物的身体，现在是我们取回它的时候了。你现在的任务是到锡月林地去，杀死&pos:(132,252,-295,2)狮鹫&并取回已经魔化的钢锭。",
				[45] = "        狄赛奥入侵之后，很多生物发生了变异而魔化。经过这些魔物身体的影响，钢锭会呈现一种特别的状态，我们叫它魔化钢锭。我和我的同伴曾经将大量的钢锭微粒植入各种魔物的身体，现在是我们取回它的时候了。你现在的任务是到锡月林地去，杀死&pos:(605,213,414,2)幽魂纳迦&并取回已经魔化的钢锭。",
				[50] = "        狄赛奥入侵之后，很多生物发生了变异而魔化。经过这些魔物身体的影响，钢锭会呈现一种特别的状态，我们叫它魔化钢锭。我和我的同伴曾经将大量的钢锭微粒植入各种魔物的身体，现在是我们取回它的时候了。你现在的任务是到幽暗森林去，杀死&pos:(-171,285,574,2)小魔女&并取回已经魔化的钢锭。",
				[55] = "        狄赛奥入侵之后，很多生物发生了变异而魔化。经过这些魔物身体的影响，钢锭会呈现一种特别的状态，我们叫它魔化钢锭。我和我的同伴曾经将大量的钢锭微粒植入各种魔物的身体，现在是我们取回它的时候了。你现在的任务是到灰雾荒原去，杀死&pos:(-400,268,-242,2)多头蛇蜥&并取回已经魔化的钢锭。",
				[60] = "        狄赛奥入侵之后，很多生物发生了变异而魔化。经过这些魔物身体的影响，钢锭会呈现一种特别的状态，我们叫它魔化钢锭。我和我的同伴曾经将大量的钢锭微粒植入各种魔物的身体，现在是我们取回它的时候了。你现在的任务是到沉睡丛林去，杀死&pos:(-385,460,-374,4)食人雾&并取回已经魔化的钢锭。",
				[65] = "        狄赛奥入侵之后，很多生物发生了变异而魔化。经过这些魔物身体的影响，钢锭会呈现一种特别的状态，我们叫它魔化钢锭。我和我的同伴曾经将大量的钢锭微粒植入各种魔物的身体，现在是我们取回它的时候了。你现在的任务是到沉睡丛林去，杀死&pos:(142,506,-198,4)丛林黑豹&并取回已经魔化的钢锭。",
				[70] = "        狄赛奥入侵之后，很多生物发生了变异而魔化。经过这些魔物身体的影响，钢锭会呈现一种特别的状态，我们叫它魔化钢锭。我和我的同伴曾经将大量的钢锭微粒植入各种魔物的身体，现在是我们取回它的时候了。你现在的任务是到沉睡丛林去，杀死&pos:(546,505,25,4)枯木杀手&并取回已经魔化的钢锭。",
				[75] = "        狄赛奥入侵之后，很多生物发生了变异而魔化。经过这些魔物身体的影响，钢锭会呈现一种特别的状态，我们叫它魔化钢锭。我和我的同伴曾经将大量的钢锭微粒植入各种魔物的身体，现在是我们取回它的时候了。你现在的任务是到沉睡丛林去，杀死&pos:(122,543,349,4)咬趾虫&并取回已经魔化的钢锭。",
				[80] = "        狄赛奥入侵之后，很多生物发生了变异而魔化。经过这些魔物身体的影响，钢锭会呈现一种特别的状态，我们叫它魔化钢锭。我和我的同伴曾经将大量的钢锭微粒植入各种魔物的身体，现在是我们取回它的时候了。你现在的任务是到沉睡丛林去，杀死&pos:(122,543,349,4)咬趾虫&并取回已经魔化的钢锭。",
			},
		[3] = {
				[1] = "        哈撒娜米要你前往科莱斯平原东北边的晨光镇，找&pos:(-169,255,438,1)加斯特·维汀&学习一些法器制造的知识，并通过加斯特给你的小考验。 ",
				[2] = "        哈撒娜米要你前往科莱斯平原东北边的晨光镇，找&pos:(-169,255,438,1)加斯特·维汀&学习一些锻造的知识，并通过加斯特给你的小考验。 ",
				[3] = "C类任务3. ",
			},
		[4] = {
				[1] = "        武器的打造过程中经常会需要一些特殊的原材料，那些看起来很普通的东西有可能使你的作品大放异彩。炼金师们拥有神奇的点石成金能力，并且能够制造出有生命力的药水，很多时候我们需要它。\r        呃，今天让我们来认识一些新的材料，当然，你需要先把这些东西带到我这里来。\r\r^006acc任务提示：如果你没有学习炼金师副职业，你需要向你周围的炼金师朋友求助或是购买。 ",
				[2] = "        吃饱喝足才有力气进行武器制造的学习！当务之急，我们需要找点食物来！\r\r^006acc任务提示：如果你没有学习厨师副职业，你需要向你周围的厨师朋友求助或是购买。 ",
				[3] = "D类任务3. ",
			},
		},

	DeliverTalkNpc = "        你学习武器师也有一段时间了，虽然进展可喜，只是还没有达到我的希望。也许我可以帮助你的武器制造能力更快的提升，需要我的帮助吗？",
	DeliverTalkPlayer = "期望您能帮助我。",

	CompleteTaskCommon = "通过加斯特·维汀的考验",

	SubmitItemText = "展示自己的作品",
	SubmitItemPrologue = "请向哈撒娜米展示一件你当前等级武器制造可生产的最高使用级别的武器（优秀或者精良品质均可）。\r^006acc提示：你的武器师导师不会私自扣留展示的作品。",

	AwardTalkNpc = "你果然没有让我失望，&name&，不出几年，你就会全面超越我成为下一个天才武器师！",
	AwardTalkPlayer = "永远不会忘记您对我的教导！",


}

--防具师日常活动.FayeS
TaskListTextString[12763] = {

	DescriptionText = {
		[0] = { [0] = "        自由港工匠之家的凯尔特大师能够帮助你提升你的防具师技艺。",},
		[1] = {	[1] = "        你需要向凯尔特大师展示你当前“防具师”等级可以制造的防具（优秀/精良品质）。\r\r^006acc任务提示：展示的作品不会被收取。",},
		[2] = {
				[40] = "当初在锡月林地学习技艺的时候，年轻的凯尔特大师曾经受到过狮鹫的攻击，现在，他希望你能帮他除掉那些狮鹫以报当年之仇。",
				[45] = "当初在锡月林地学习技艺的时候，年轻的凯尔特大师曾经受到过幽魂纳迦的攻击，现在，他希望你能帮他除掉那些幽魂纳迦以报当年之仇。",
				[50] = "当初在幽暗森林学习技艺的时候，年轻的凯尔特大师曾经受到过小魔女的攻击，现在，他希望你能帮他除掉那些小魔女以报当年之仇。",
				[55] = "当初在灰雾荒原学习技艺的时候，年轻的凯尔特大师曾经受到过多头蛇蜥的攻击，现在，他希望你能帮他除掉那些多头蛇蜥以报当年之仇。",
				[60] = "当初在沉睡丛林学习技艺的时候，年轻的凯尔特大师曾经受到过食人雾的攻击，现在，他希望你能帮他除掉那些食人雾以报当年之仇。",
				[65] = "当初在沉睡丛林学习技艺的时候，年轻的凯尔特大师曾经受到过沉睡丛林的丛林黑豹的攻击，现在，他希望你能帮他除掉那些丛林黑豹以报当年之仇。",
				[70] = "当初在沉睡丛林学习技艺的时候，年轻的凯尔特大师曾经受到过沉睡丛林的枯木杀手的攻击，现在，他希望你能帮他除掉那些枯木杀手以报当年之仇。",
				[75] = "当初在沉睡丛林学习技艺的时候，年轻的凯尔特大师曾经受到过沉睡丛林的咬趾虫的攻击，现在，他希望你能帮他除掉那些咬趾虫以报当年之仇。",
				[80] = "当初在沉睡丛林学习技艺的时候，年轻的凯尔特大师曾经受到过沉睡丛林的咬趾虫的攻击，现在，他希望你能帮他除掉那些咬趾虫以报当年之仇。",
			},
		[3] = {
				[1] = "        凯尔特大师请你拜访自由港希望之光图书馆的学者&pos:(-161,230,-33,1)乔西雅斯·星辉&，并向她请教一本古老防具设计图的下落。 ",
				[2] = "        凯尔特大师要你前往科莱斯平原东北边的晨光镇拜访&pos:(-173,247,389,1)莉莉娅&并请教护甲片制作相关的知识。莉莉娅会给你提供足够的材料让你练习制作。 ",
				[3] = "C类任务3. ",
			},
		[4] = {
				[1] = "        这些灵能碎粒那么不起眼，但是它所蕴藏的能量却远比你所能想象到的多。只有技艺纯熟的工艺师才能掌握将碎粒凝结成精华的办法，而我只需要凝结的精华。\r\r^006acc任务提示：如果你没有学习工艺师副职业（或者没有达到2级），你需要向你周围的工艺师朋友求助。 ",
				[2] = "        珠宝师在切割异质晶石的时候会产生一些粉末副产品——通常情况下，这些粉末并无大用仅仅被用来制作一些小的手工艺品。\r       不过对于我们来说就不一样，那可是一种能够让衣物闪烁出奇异光芒的材料。现在你的任务就是去找到一些这种宝石粉尘。\r\r^006acc任务提示：如果你没有学习珠宝师副职业，你需要向你周围的珠宝师朋友求助或是购买。 ",
				[3] = "D类任务3. ",
			},
		},

	DeliverTalkNpc = "        我注意到你学习防具师也有一段时间了，感觉如何？是不是有一些时候也会遇到瓶颈？\r        我可以帮助你的防具制造能力更快的提升，需要我的帮助吗？",
	DeliverTalkPlayer = "期望您能帮助我。",

	CompleteTaskCommon = {
			[1] = "找到古旧的防具设计图",
			[2] = "完成护甲片的制作",
			},

	SubmitItemText = "展示自己的作品",
	SubmitItemPrologue = "请向凯尔特大师展示一件你当前等级防具制造可生产的最高使用级别的防具（优秀或者精良品质均可）。\r\r^006acc提示：你的防具师导师不会扣留你展示的作品。",

	AwardTalkNpc = "&name&，你的防具师技艺正突飞猛进，这真让我高兴！",
	AwardTalkPlayer = "永远不会忘记您对我的教导！",


}
----初次领取历练精华,
TaskListTextString[13008] = {
	DescriptionText = "在各个新手出生地或者自由港的花街，找到克莱蒙多引导者的侍女，领取升级红利：历练精华。",
	DeliverTalkNpc = "        我将赠与你历练精华，以克莱蒙多的名义。无论富有或贫瘠，无论尊崇或卑微，我们都将公平地享有这个世界赐予我们的荣耀。",
	DeliverTalkPlayer = "我接受。",
}
----魔方百层塔队长选关,
TaskListTextString[13012] = {
	DescriptionText = "根据队长在暴风幻境的通关进度，开启相应的传送水晶。",
	DeliverTalkNpc = "        虽然我能透视整个暴风幻境的全部风景，但我只能根据你本周内的进度，开启相应的传送水晶。",
	DeliverTalkPlayer = "我要开启。",
}
----宝石重铸,,
TaskListTextString[13222] = {
	DescriptionText = "克瑞斯特提供1级宝石重铸服务。你可以放入任意一块1级宝石，他可以帮你重铸成另外一块1级宝石，但并不一定是不同种类的宝石。^006acc重铸后的宝石将会绑定。",
	DeliverTalkNpc = "        我可以帮你重铸宝石！你把任意一块1级宝石交给我，就可以重铸成另外一块1级宝石，但并不一定是不同种类的宝石。^006acc重铸后的宝石将会绑定。",
	DeliverTalkPlayer = "我要进行重铸。",
	AwardTalkNpc = "完成",
	AwardTalkPlayer = "完成",
	SubmitItemText = "进行宝石重铸",
	SubmitItemPrologue = "    放入任意一块1级宝石（无论是不是绑定的），你都会得到另一块绑定的1级宝石，种类是完全随机的。",

}
--征集令大号奖励脚本任务
TaskListTextString[13388] = {
	[0]="你不在副本区域内，无法获得【高手荣耀值】。",
	[1]="你的【高手荣耀值】提升了1点。10分钟内无法从道标要塞中获得【高手荣耀值】和恩德值的提升。",
	[2]="你的【高手荣耀值】提升了3点。10分钟内无法从帝王谷中获得【高手荣耀值】和恩德值的提升。",
	[3]="你的【高手荣耀值】提升了5点。10分钟内无法从迷失灯塔中获得【高手荣耀值】和恩德值的提升。",
	[4]="你的【高手荣耀值】提升了6点。10分钟内无法从战神之魂竞技场中获得【高手荣耀值】和恩德值的提升。",
	[5]="你的【高手荣耀值】提升了4点。10分钟内无法从荣耀之陵中获得【高手荣耀值】和恩德值的提升。",
	[6]="你的【高手荣耀值】提升了5点。10分钟内无法从阴魂要塞1层中获得【高手荣耀值】和恩德值的提升。",
	[7]="你的【高手荣耀值】提升了7点。10分钟内无法从天空之城中获得【高手荣耀值】和恩德值的提升。",
	[8]="你的【高手荣耀值】提升了8点。10分钟内无法从先祖陵寝外围中获得【高手荣耀值】和恩德值的提升。",
	[9]="你的【高手荣耀值】提升了10点。10分钟内无法从先祖陵寝中获得【高手荣耀值】和恩德值的提升。",

}
----纪元每周领经验,
TaskListTextString[13579] = {
	DescriptionText = "每周可以领取一份纪元之礼。随着纪元的进展，赠礼会更加丰厚。",
	DeliverTalkNpc = "        你每周可以从我这里领取一份经验赠礼，等级越高经验越高，建议你在周日24：00前领取。随着纪元的进展，赠礼也会更加丰厚。",
	DeliverTalkPlayer = "我要领取。",
	Broadcast = "&$name&领取了本周的纪元之礼。当进入下一个纪元时，这份赠礼会更加丰厚。",
}
----凤凰令1级,
TaskListTextString[13588] = {
	DescriptionText = "按照凤凰令的要求前往%s剿灭%s。\r^006acc[任务提示]推荐组队，善用XP技能；放弃任务将消耗次数\r[纪元奖励]黑龙纪元之后经验+50%%",
	DescriptionMonster =					--怪物地点和名字
	{
		[1] = { "遗忘之海","铁鳄武士"},
		[2] = { "遗忘之海","暗月嗜血者"},
		[3] = { "遗忘之海","食魂魔"},
		[4] = { "锡月林地","堕落幼龙"},
		[5] = { "锡月林地","幽魂纳迦"},
		[6] = { "幽暗森林","密林之友"},
		[7] = { "灰雾荒原","多头蛇蜥"},
		[8] = { "沉睡丛林","巨型蜘蛛"},
		[9] = { "沉睡丛林","巨魔狂战士"},
		[10] = { "沉睡丛林的血颅营地一带","杀人藤"},
		[11] = { "沉睡丛林","丛林大矮人"},
	},
	DescriptionTextCount = "^006acc神兽令本周剩余次数：%d 次\r^50210f",
	DescriptionText1 = "* 20分钟内达成：经验 + 10% \r",
	DescriptionText2 = "** 15分钟内达成：经验 + 20% \r",
	DescriptionText3 = "*** 10分钟内达成：经验 + 30% \r",
	BroadcastOver60		= "&$name&达成^ffd700<凤凰令>^14A9FF耗时^ffd700超过1小时以上%s",
	BroadcastBelowOne	= "&$name&达成^ffd700<凤凰令>^14A9FF耗时^ffd700%d秒%s",
	BroadcastCommon		= "&$name&达成了^ffd700<凤凰令>^14A9FF耗时^ffd700%d分%d秒%s",
	BroadcastClass1 = "^14A9FF,还需继续努力！（增加2点活跃度）",
	BroadcastClass2 = "^14A9FF,成绩马马虎虎！（增加2点活跃度）",
	BroadcastClass3 = "^14A9FF,表现超乎想象！（增加2点活跃度）",
	BroadcastClass4 = "^14A9FF,成就堪称神勇！（增加2点活跃度）",
}

--飞行活动：暴风邪能入侵
TaskListTextString[13520] = {
	DeliverTaskTalk_npc = "        暴风军团的爪牙在我们未知的情况下已经侵入自由港，并且埋藏下很多信息收集装置来获取我们的信息。由于邪能风暴的保护，这些装置都被隐藏在大气中难以被发现。为了我们赖以生存的家园，请和我们一起行动起来。\r\r^006acc64级以下（包括64级）角色获得的碧蓝天空徽章是绑定的，不可交易。",
	DeliverTaskTalk_player = "很乐意为保护自由港贡献一份力量。",

	AwardTalk_npc = "        这些邪能核心里记录了暴风军团的一部分魔法信息，这会对我们以后对抗暴风军团研究对策起到很大的作用。谢谢你，&name&。",
	AwardTalk_player = "很高兴能帮助大家保卫家园。",

	Description = "^006acc提示：任务NPC库斯位于自由港希望之光图书馆的顶部\r\r        ^50210f拿着这个“邪能风暴感应器”，它能定位邪能风暴，并尝试使邪能风暴的隐身魔法失效将核心暴露出来，取下那些核心交给我，自由港会记住你的善举。\r        需要提醒你的是，邪能风暴有一种自保护功能，在感知过程中它可能会启动自爆程序来避免我们获得核心，那你就可以继续寻找下一个邪能风暴点。\r\r^006acc任务提示：当你和另外一个探险者同时发现一个邪能风暴点，可能只有一个能取到该风暴核心。另外，如果你使用了感应器却无法使邪能风暴显形，请尝试微微移动以寻找更好的位置。\r\r64级以下（包括64级）角色获得的碧蓝天空徽章是绑定的，不可交易。",


}

----辉光令1级
TaskListTextString[13637] = {
	DescriptionText = "按照辉光令的要求前往%s剿灭%s。\r^006acc[任务提示]推荐组队，善用XP技能；放弃任务将消耗次数",
	DescriptionMonster =					--怪物地点和名字
	{
		[1] = { "凯旋平原","比尔血盟刺客"},
		[2] = { "凯旋平原","黑矮人矿工"},
		[3] = { "凯旋平原","人类主权同盟精英"},
		[4] = { "凯旋平原","血纹苦修者"},
		[5] = { "凯旋平原","黑地精保镖"},
	},
	DescriptionTextCount = "^006acc神兽令本周剩余次数：%d 次\r^50210f",
	DescriptionText1 = "* 30分钟内达成：信仰值 + 10%\r",
	DescriptionText2 = "** 20分钟内达成：信仰值 + 20%\r",
	DescriptionText3 = "*** 12分钟内达成：信仰值 + 30%\r",
	BroadcastOver60		= "&$name&达成^ffd700<辉光令>^14A9FF耗时^ffd700超过1小时以上%s",
	BroadcastBelowOne	= "&$name&达成^ffd700<辉光令>^14A9FF耗时^ffd700%d秒%s",
	BroadcastCommon		= "&$name&达成了^ffd700<辉光令>^14A9FF耗时^ffd700%d分%d秒%s",
	BroadcastClass1 = "^14A9FF,还需继续努力！（增加2点活跃度）",
	BroadcastClass2 = "^14A9FF,成绩马马虎虎！（增加2点活跃度）",
	BroadcastClass3 = "^14A9FF,表现超乎想象！（增加2点活跃度）",
	BroadcastClass4 = "^14A9FF,成就堪称神勇！（增加2点活跃度）",
}

--装备本随机周常主任务（英雄主义的呐喊）
TaskListTextString[13642] = {
	DescriptionText = "完成挑战，得到英雄贡献值。",
	DeliverTalkNpc = "        这是每周一次的英雄级挑战任务。任务目标并不是固定的，你将有可能受命前往灾域虚空或者万王之陵去完成挑战。\r[任务提示]放弃领取到的任务，将丧失本周的挑战机会。\r[主要奖励] 英雄贡献值 30点 （用于购买英雄级装备）",
	DeliverTalkPlayer = "我要领取。",
	Broadcast = "",
}



--雷辛格不会告诉你.FayeS
TaskListTextString[13643] = {

	DescriptionText = {
		[0] = "^006acc【雷辛格日常活动】\r\r        ^50210f埃萨隆会告诉你一些不为人知的小秘密。\r[任务奖励]雷辛格声望、经验",
		[1] = "^006acc【雷辛格日常活动】\r\r        ^50210f知道雷辛格哪里有最美味的葡萄酒么？毋庸置疑当然是托托酒馆！不过托托那个老家伙总是很抠门不肯送酒。不过我知道一个不用花钱也可以喝到酒的好办法。当然告诉你这个办法的好处就是帮我先弄一小桶葡萄酒来。\r        去石工玫瑰的大工匠那里，找出他的&pos:(-406,284,-377,26)工具箱&里的螺丝刀。然后，最关键的，就是去托托酒馆的二楼拐角，记住一定是二楼！否则你会被被托托那个老家伙抓去酿酒！用螺丝刀钻开那个大&pos:(-488,282,-158,26)酒桶&就可以弄到酒了！\r        一定不要被人发现，如果被发现，不要告诉别人是我说的！" ,
		[2] = "^006acc【雷辛格日常活动】\r\r        ^50210f你从自由港来吧？不知道你有没有见过一对夫妇，他们的名字是斯洛斯·乔和凯瑟丽·埃佩里奥，当年凯瑟丽小姐放弃王族身份，执意要跟斯洛斯那个穷小子在一起，在雷辛格可谓是轰动一时！也不知道他们现在生活的怎样了。\r        你不相信？旧城区当年斯洛斯和凯瑟丽小姐约会的&pos:(-352,221,-269,26)轨道车&下面，还有他们当时一起刻下的誓言呢！\r        拿着这张纸，去找那个如今已经废弃了的轨道车，拓写下他们偷偷刻的字，你就会相信我的话了！" ,
		[3] = "^006acc【雷辛格日常活动】\r\r        ^50210f大部分孤陋寡闻的人都不知道石工玫瑰门前的喷泉里有鱼，他们都认为这么清澈的喷泉水里如果有鱼早就被发现了。\r        其实，那其中生长着一种全身透明的小鱼，有点像外面河流里的晶骨鱼，只是它的体型小很多。你不相信？那我们可以证明一下！\r        你可以在学术区的&pos:(-493,275,-432,26)大树&下挖到一种小虫子，把它镶在我给你的鱼竿上，去&pos:(-459,280,-382,26)喷泉&里钓鱼试试，你会相信我的！" ,
		},

	DeliverTalkNpc = "        在无所不知的埃萨隆面前，永远不要夸口你对这座城市了解很多，我在这里生活了几十年，最喜欢收集有意思的事情，而这些东西，除了我，没有人会告诉你。",
	DeliverTalkPlayer = "我对有趣的事情也很感兴趣。",

	AwardTalkNpc = "瞧，你真的把它取回来了！也许明天我还能告诉你一些更有趣的事儿！",
	AwardTalkPlayer = "我很期待。",


}

--【雷辛格日常】换防令
TaskListTextString[13758] = {
	DescriptionText = "^006acc【雷辛格日常活动】\r\r        ^50210f找到雷辛格内正在警戒的城卫巡防队卫兵，和他对话颁布换防令让他去休息。你总共需要对5个卫兵颁布换防令。他们分布在雷辛格城市的各个角落。\r[任务奖励]雷辛格声望、经验、有几率获得血色咒文",
	DeliverTalkNpc = "        我们巡防队每日每夜都守卫着雷辛格的安全，但是我们的卫兵们都不是铁打的，他们也需要换班休息，你能帮我去颁布这一班的换防令么？",
	DeliverTalkPlayer = "我要领取。",
	AwardTalkNpc = "本次防务结束，解散休息。",
	AwardTalkPlayer = "完成。",
	Broadcast = "&$name&参加雷辛格换防令任务获得了血色咒文（蓝）！",
	CompleteTask = "颁布换防令",
}
--【竞技场热身赛奖励】根据积分发称号
TaskListTextString[13780] = {
	DescriptionText = "根据热身赛的积分，颁发称号。",
	DeliverTalkNpc = "        竞技场的热身赛季已经结束。神魔竞技场决定根据你的积分授予相应的称号，此外还有很丰厚的奖品等着你来拿。",
	DeliverTalkPlayer = "我要领取称号！",
}
--【雷辛格日常】阿敢快跑
TaskListTextString[13765] = {
	DescriptionText = "^006acc【雷辛格日常活动】\r\r        ^50210f在雷辛格城东面的&pos:(167,228,-241,26)凯旋平原&找到奔跑中的阿敢，跟随阿敢奔跑30例（每例约40米）地。\r[任务奖励]雷辛格声望、经验、有几率获得星辰结晶或信仰源能",
	DeliverTalkNpc = "        阿敢又开始了他的奔跑，没有人知道他为什么而跑，但是却对他趋之若鹜。已经有很多人都跟在他身后奔跑并获得了不少的收获，你也去试试吧。",
	DeliverTalkPlayer = "好的，我这就去找到阿敢。",
	AwardTalkNpc = "看着阿敢的背影你都会获得无穷的力量。",
	AwardTalkPlayer = "是吗？我怎么没感觉……",
	Broadcast = "&$name&完成<阿敢快跑>任务获得了宝物！",
	CompleteTask = "跟随阿敢奔跑30例",
}
--【体验服发奖】活跃度
TaskListTextString[13915] = {
	DescriptionText = "只要达到足够的活跃度，曙光先锋团的勇士们就可以领取纪念金币，每份奖励每周只能领取一次。\r活跃度20点:3枚\r活跃度45点:4枚\r活跃度70点:5枚\r活跃度95点:6枚\r活跃度120点:7枚\r活跃度145点:8枚\r活跃度165点:9枚\r活跃度185点:10枚\r活跃度200点:11枚\r",
	DeliverTalkNpc = "只要达到足够的活跃度，曙光先锋团的勇士们就可以领取纪念金币，每份奖励每周只能领取一次。\r活跃度20点:3枚\r活跃度45点:4枚\r活跃度70点:5枚\r活跃度95点:6枚\r活跃度120点:7枚\r活跃度145点:8枚\r活跃度165点:9枚\r活跃度185点:10枚\r活跃度200点:11枚\r",
	DeliverTalkPlayer = "我要领取。",
	AwardTalkNpc = "",
	AwardTalkPlayer = "",
	CompleteTask = "每周活跃度达到",
}
----凤凰令·真
TaskListTextString[14160] = {
	DescriptionText = "",
	BroadcastOver60		= "&$name&达成^ffd700<凤凰令>^14A9FF耗时^ffd700超过1小时以上%s",
	BroadcastBelowOne	= "&$name&达成^ffd700<凤凰令>^14A9FF耗时^ffd700%d秒%s",
	BroadcastCommon		= "&$name&达成了^ffd700<凤凰令>^14A9FF耗时^ffd700%d分%d秒%s",
	BroadcastClass1 = "^14A9FF,还需继续努力！（增加2点活跃度）",
	BroadcastClass2 = "^14A9FF,成绩马马虎虎！（增加2点活跃度）",
	BroadcastClass3 = "^14A9FF,表现超乎想象！（增加2点活跃度）",
	BroadcastClass4 = "^14A9FF,成就堪称神勇！（增加2点活跃度）",
}
----辉光令·真
TaskListTextString[14173] = {
	DescriptionText = "",
	BroadcastOver60		= "&$name&达成^ffd700<辉光令>^14A9FF耗时^ffd700超过1小时以上%s",
	BroadcastBelowOne	= "&$name&达成^ffd700<辉光令>^14A9FF耗时^ffd700%d秒%s",
	BroadcastCommon		= "&$name&达成了^ffd700<辉光令>^14A9FF耗时^ffd700%d分%d秒%s",
	BroadcastClass1 = "^14A9FF,还需继续努力！（增加2点活跃度）",
	BroadcastClass2 = "^14A9FF,成绩马马虎虎！（增加2点活跃度）",
	BroadcastClass3 = "^14A9FF,表现超乎想象！（增加2点活跃度）",
	BroadcastClass4 = "^14A9FF,成就堪称神勇！（增加2点活跃度）",
}

--七日谈收取，成就
TaskListTextString[14094] = {
	DeliverTaskTalk_npc = "        你在暮光之城发现了七日谈的章节书页了吗？如果你收齐所有的7章，我可以给你一本完整的《七日谈》。",
	DeliverTaskTalk_player = "我找到了其中的一章。",

	AwardTalk_npc = "        你提交的这个章节确实是七日谈的内容",
	AwardTalk_player = "完成任务。",

	Description = "你在暮光之城发现了七日谈的章节书页了吗？它们分散在城里的各个角落。如果你收齐所有的7章，我可以给你一本完整的《七日谈》。\r\r^006acc任务提示：每一本七日谈的章节只能提交一次，你需要全部交纳7本不同的章节才能从比索·萨处换取七日谈的完整书籍。七日谈章节随机刷新在雷辛格城内的角落，拾取后绑定。",

	CompleteTaskCommon = "提交《七日谈》中的一章",

	SubmitItemText = "提交你找到的《七日谈》中的一章",
	SubmitItemPrologue = "请提交你在雷辛格找到的《七日谈》中的一章，已经提交过的章节不能重复提交。",
}

--春节符文种植
TaskListTextString[14262] = {
	DeliverTaskTalk_npc = "        春天来到之时，万物复苏，以神灵之名，为你赐福。\r        有耕种才有收获，神的力量可以助你扭转时空秩序，更换符文能量。",
	DeliverTaskTalk_player = "尝试一下。",

	AwardTalk_npc = "        发放符文",
	AwardTalk_player = "完成任务。",

	DescriptionText = {
				[0] = "        向春愿节使者提交一枚普通的3-5级符文做为种子，在春天到来之后你会得到意想不到的收获！\r\r^006acc符文种植规则：\r春愿节使者只接受种植者本职业的3-5级普通符文并将它转化为符文种子，当春愿节结束，种子受到神灵祝福而成熟时，你可以向春愿节使者出示符文种植凭证书来领取你的收获。（收获的符文颜色自选，天赋随机，职业为提交者职业，且绑定）\r预期符文的能量收获如下：\r3级普通符文种子->能量值6点的3级普通符文\r4级普通符文种子->能量值7点的4级普通符文\r5级普通符文种子->能量值10点的5级普通符文",
				[1] = "        你已经向春愿节使者提交了符文种子，耐心等待一个好收成吧！\r        当春愿节繁忙的祭祀结束，代表红、黄、蓝色符文能量的渲染祝福者将出现在春愿节使者的旁边。届时，与对应颜色的渲染祝福者对话选择你想要收获的符文的色彩并收获它。\r        春愿节快乐！\r\r^006acc任务提示：在与渲染祝福者对话之前",
				},

	CompleteTaskCommon = {
				[0] = "种植符文",
				[1] = "选择颜色并收获",
				},

	SubmitItemText = {
				[0] = "种植3-5级普通符文",
				[1] = "选择渲染能量颜色并收获",
				},
	SubmitItemPrologue = {
				[0] = "将本职业3-5级普通符文作为种子交给春愿节使者，并索取符文种植凭证书。",
				[1] = "如果你已经选择了渲染符文的能量，那么请向春愿节使者出示你你的符文种植凭证书以收获你春愿节前种植的符文。",
				},
}
--春节杀年兽礼箱
TaskListTextString[14276] = {
	[0]="&$name&打开了【新春祝福】，召唤了一只稀有的宠物灵魂。",
	[1]="&$name&打开了【新春祝福】，十分幸运的召唤出了陵寝守护兽的灵魂！祝愿其新的一年能保持这样的好运。",
	[2]="&$name&打开了【新春祝福】，十分幸运的召唤出了霸王骨骸的灵魂！祝愿其新的一年能保持这样的好运。",
	[3]="&$name&打开了【新春祝福】，十分幸运的召唤出了那迦公主的灵魂！祝愿其新的一年能保持这样的好运。",
	[4]="&$name&打开了【新春祝福】，十分幸运的召唤出了暴风雏龙的灵魂！祝愿其新的一年能保持这样的好运。",
	[5]="&$name&打开了【新春祝福】，非常幸运的召唤出了阿波菲斯的灵魂！祝愿其新的一年能有更好的运气。",
	[6]="&$name&打开了【新春祝福】，非常幸运的召唤出了花妖的灵魂！祝愿其新的一年能有更好的运气。",
}

--new_公会_通用建设任务
TaskListTextString[14379] = {
	DeliverTaskTalk_npc = "        每个公会成员的努力，都可以为公会带来收益！怎么样！&name&,你准备好为公会贡献你的一份力量了吗？",
	DeliverTaskTalk_player = "时刻准备效劳！",

	AwardTalk_npc = "        你已经完成这次公会交给你的事务了吗？",
	AwardTalk_player = "是的。",

	DescriptionText = {
				[1] = "        公会的进步离不开每一位成员的努力，我们都知道我们会成为克兰蒙多最著名的公会之一，只不过千里之行始于足下，这个伟大的目标得一步一步从基础建设开始。\r\r^006acc任务提示：接受此事务的同时将接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、工会资金的增长，以及资源值的提升。",
				[2] = "        公会的进步离不开每一位成员的努力，我们都知道我们会成为克兰蒙多最著名的公会之一，只不过千里之行始于足下，这个伟大的目标得一步一步从基础建设开始。\r        ^006acc完成此任务可能开启公会基地的神之恩赐幸运宝库。\r\r任务提示：接受此事务的同时将接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、工会资金的增长，以及资源值的提升。",

				},
	TaskTributeText = "$name已经完成了一轮的建设任务！感谢他为公会做出的努力！ ",

	CompleteTaskCommon = {
				--简单任务追踪
				[14409] = "完成【水之凝粹】",
				[14410] = "完成【火之凝粹】",
				[14411] = "完成【秘之凝粹】",
				[14412] = "完成【叶之凝粹】",
				[14413] = "完成【地之凝粹】",
				[14414] = "完成【迷失的魂魄】",
				[14415] = "完成【茫然的魂魄】",
				[14416] = "完成【花语精灵】",
				[14417] = "完成【草木精灵】",
				[14418] = "完成【水之智者】",
				[14419] = "完成【击杀恶灵】",
				[14420] = "完成【击杀奸细】",
				[14421] = "完成【击杀蛀虫】",
				[14422] = "完成【击杀污泥吐纳者】",
				[14423] = "完成【击杀伤寒鼠】",
				[14424] = "完成【地面磁场探测】",
				[14425] = "完成【水气磁场探测】",
				[14426] = "完成【观测能量点】",
				[14427] = "完成【观测波动点】",
				[14428] = "完成【观测地脉点】",
				[14429] = "完成【风之凝粹】",
				[14430] = "完成【钢铁凝粹】",
				[14431] = "完成【雾霭凝粹】",
				[14432] = "完成【生灵凝粹】",
				[14433] = "完成【虚无凝粹】",
				[14434] = "完成【被囚的魂魄】",
				[14435] = "完成【渐逝的魂魄】",
				[14436] = "完成【风语精灵】",
				[14437] = "完成【雾语精灵】",
				[14438] = "完成【空语精灵】",
				[14439] = "完成【超度恶灵】",
				[14440] = "完成【驱除奸细】",
				[14441] = "完成【击杀飞蚁】",
				[14442] = "完成【击杀缚灵】",
				[14443] = "完成【击杀黑帮工】",
				[14444] = "完成【天空磁场探测】",
				[14445] = "完成【雾气磁场探测】",
				[14446] = "完成【观测魔能点】",
				[14447] = "完成【观测原点】",
				[14448] = "完成【观测节点】",
				--困难任务追踪
				[9349] = "完成【花汁萃取】",
				[9362] = "完成【黛丝的种子】",
				[9456] = "完成【白鱼子酱】",
				[9458] = "完成【喂饱那只猫】",
				[9450] = "完成【桑吉尔夫的酒瘾】",
				[9446] = "完成【给盗贼首领的酒】",
				[9435] = "完成【弱效饮食药剂】",
				[9437] = "完成【勇猛坚固药剂】",
				[9439] = "完成【药剂试喝】",
				[8577] = "完成【给沙漠之北的警告】",
				[8578] = "完成【给沙漠之东的警告】",
				[8581] = "完成【石料之争】",
				[8582] = "完成【欠债还钱】",
				[8583] = "完成【塞海莱的秘诀】",
				[8584] = "完成【我们需要名厨师】",
				[8579] = "完成【空间的真意】",
				[8580] = "完成【遗忘之海的航标】",
				[8557] = "完成【德索拉的知识】",
				[8558] = "完成【石料！石料！】",
				[8559] = "完成【黄沙下的金砂】",
				[8560] = "完成【搜寻队的建造图】",
				[8561] = "完成【巨灵的学识】",
				[8562] = "完成【神秘来信】",
				[8563] = "完成【尽职的看护者】",
				[8564] = "完成【执着的渔业家】",
				[8565] = "完成【杂货商的愿望】",
				[8566] = "完成【盗贼之王的交易】",
				[9402] = "完成【花汁萃取】",
				[9409] = "完成【尼鲁的种子】",
				[9418] = "完成【矿石精选】",
				[9434] = "完成【战备铜矿】",
				[9463] = "完成【夜旗鱼子酱】",
				[9466] = "完成【吵人的猫】",
				[9451] = "完成【盗贼的夜旗鱼汤】",
				[9455] = "完成【鲁撒克的酒瘾】",
				[9440] = "完成【药剂初配】",
				[9442] = "完成【初级法能药剂】",
				[9444] = "完成【药剂初尝】",
				[10446] = "完成【饥饿的“甜心”】",
				[10447] = "完成【饥饿的“甜心”】",
				[10448] = "完成【饥饿的“甜心”】",
				[10449] = "完成【饥饿的“甜心”】",
				[10450] = "完成【饥饿的“甜心”】",
				[10451] = "完成【饥饿的“甜心”】",
				[8585] = "完成【给锡月林地的警告】",
				[8586] = "完成【给幽暗森林的警告】",
				[8589] = "完成【寻宝的帮手】",
				[8590] = "完成【奥卡斯通的买卖】",
				[8591] = "完成【德弗丁的菜谱】",
				[8592] = "完成【酒会的美酒】",
				[8587] = "完成【自然与人力】",
				[8588] = "完成【染料换木料】",
				[8567] = "完成【贤者之眼的馈赠】",
				[8568] = "完成【神射手泰尔亚】",
				[8569] = "完成【爱神泉的求助】",
				[8570] = "完成【玫瑰之争】",
				[8571] = "完成【天空守望者的求助】",
				[8572] = "完成【魔女的交易】",
				[8573] = "完成【卖火柴的小女孩】",
				[8574] = "完成【又是正义】",
				[8575] = "完成【幸存的精灵】",
				[8576] = "完成【避风镇的药品商】",
				[9622] = "完成【生还者】",
				[9623] = "完成【画师的愿望】",
				[9624] = "完成【剧毒毒素】",
				[9625] = "完成【腐水蜘蛛】",
				[9626] = "完成【软泥浇灌的怪花】",
				[9627] = "完成【开启宝箱】",
				[9628] = "完成【种族食谱】",
				[9629] = "完成【种族食谱】",
				[9630] = "完成【勘探地表】",
				[9631] = "完成【该死的蛀虫】",
				[9935] = "完成【花汁萃取】",
				[9945] = "完成【哥伦布的种子】",
				[9954] = "完成【锌矿石精选】",
				[9958] = "完成【战备锡矿】",
				[9977] = "完成【旗鱼鱼子酱】",
				[9979] = "完成【又是吵闹的猫】",
				[9983] = "完成【给盗贼送酒】",
				[9984] = "完成【品酒的请求】",
				[9985] = "完成【中效饮食药剂】",
				[9987] = "完成【药剂再尝】",
				[10452] = "完成【饥饿的“甜心”】",
				[10453] = "完成【饥饿的“甜心”】",
				[10454] = "完成【饥饿的“甜心”】",
				},

}

--new_公会_通用非建设任务
TaskListTextString[14380] = {
	DeliverTaskTalk_npc = "        每个公会成员的努力，都可以为公会带来收益！怎么样！&name&,你准备好为公会贡献你的一份力量了吗？",
	DeliverTaskTalk_player = "时刻准备效劳！",

	AwardTalk_npc = "        你已经完成这次公会交给你的事务了吗？",
	AwardTalk_player = "是的。",

	DescriptionText = {
				[1] = "        公会的进步离不开每一位成员的努力，我们都知道我们会成为克兰蒙多最著名的公会之一，现在就让我们为自己深爱的公会贡献一份力量吧。\r\r^006acc任务提示：接受此事务的同时将接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、工会资金的增长，以及资源值的提升。",
				[2] = "        公会的进步离不开每一位成员的努力，我们都知道我们会成为克兰蒙多最著名的公会之一，现在就让我们为自己深爱的公会贡献一份力量吧。\r        ^006acc完成此任务可能开启公会基地的神之恩赐幸运宝库。\r\r任务提示：接受此事务的同时将接到另一个任务，完成同时接到的这个任务就是本次事务的完成条件。\r此任务为每轮4次，同一轮内的奖励会随着次数的增加逐次递增。完成此任务你将获得经验值、魂币和功勋奖励，同时你所在的公会将获得贡献度、活跃值、工会资金的增长，以及资源值的提升。",
				},

	TaskTributeText = "$name已经完成了一轮的公会基地任务！感谢他为公会做出的努力！ ",

	CompleteTaskCommon = {
				--简单任务追踪
				[14409] = "完成【水之凝粹】",
				[14410] = "完成【火之凝粹】",
				[14411] = "完成【秘之凝粹】",
				[14412] = "完成【叶之凝粹】",
				[14413] = "完成【地之凝粹】",
				[14414] = "完成【迷失的魂魄】",
				[14415] = "完成【茫然的魂魄】",
				[14416] = "完成【花语精灵】",
				[14417] = "完成【草木精灵】",
				[14418] = "完成【水之智者】",
				[14419] = "完成【击杀恶灵】",
				[14420] = "完成【击杀奸细】",
				[14421] = "完成【击杀蛀虫】",
				[14422] = "完成【击杀污泥吐纳者】",
				[14423] = "完成【击杀伤寒鼠】",
				[14424] = "完成【地面磁场探测】",
				[14425] = "完成【水气磁场探测】",
				[14426] = "完成【观测能量点】",
				[14427] = "完成【观测波动点】",
				[14428] = "完成【观测地脉点】",
				[14429] = "完成【风之凝粹】",
				[14430] = "完成【钢铁凝粹】",
				[14431] = "完成【雾霭凝粹】",
				[14432] = "完成【生灵凝粹】",
				[14433] = "完成【虚无凝粹】",
				[14434] = "完成【被囚的魂魄】",
				[14435] = "完成【渐逝的魂魄】",
				[14436] = "完成【风语精灵】",
				[14437] = "完成【雾语精灵】",
				[14438] = "完成【空语精灵】",
				[14439] = "完成【超度恶灵】",
				[14440] = "完成【驱除奸细】",
				[14441] = "完成【击杀飞蚁】",
				[14442] = "完成【击杀缚灵】",
				[14443] = "完成【击杀黑帮工】",
				[14444] = "完成【天空磁场探测】",
				[14445] = "完成【雾气磁场探测】",
				[14446] = "完成【观测魔能点】",
				[14447] = "完成【观测原点】",
				[14448] = "完成【观测节点】",

				--困难任务追踪
				[9349] = "完成【花汁萃取】",
				[9362] = "完成【黛丝的种子】",
				[9456] = "完成【白鱼子酱】",
				[9458] = "完成【喂饱那只猫】",
				[9450] = "完成【桑吉尔夫的酒瘾】",
				[9446] = "完成【给盗贼首领的酒】",
				[9435] = "完成【弱效饮食药剂】",
				[9437] = "完成【勇猛坚固药剂】",
				[9439] = "完成【药剂试喝】",
				[8577] = "完成【给沙漠之北的警告】",
				[8578] = "完成【给沙漠之东的警告】",
				[8581] = "完成【石料之争】",
				[8582] = "完成【欠债还钱】",
				[8583] = "完成【塞海莱的秘诀】",
				[8584] = "完成【我们需要名厨师】",
				[8579] = "完成【空间的真意】",
				[8580] = "完成【遗忘之海的航标】",
				[8557] = "完成【德索拉的知识】",
				[8558] = "完成【石料！石料！】",
				[8559] = "完成【黄沙下的金砂】",
				[8560] = "完成【搜寻队的建造图】",
				[8561] = "完成【巨灵的学识】",
				[8562] = "完成【神秘来信】",
				[8563] = "完成【尽职的看护者】",
				[8564] = "完成【执着的渔业家】",
				[8565] = "完成【杂货商的愿望】",
				[8566] = "完成【盗贼之王的交易】",
				[9402] = "完成【花汁萃取】",
				[9409] = "完成【尼鲁的种子】",
				[9418] = "完成【矿石精选】",
				[9434] = "完成【战备铜矿】",
				[9463] = "完成【夜旗鱼子酱】",
				[9466] = "完成【吵人的猫】",
				[9451] = "完成【盗贼的夜旗鱼汤】",
				[9455] = "完成【鲁撒克的酒瘾】",
				[9440] = "完成【药剂初配】",
				[9442] = "完成【初级法能药剂】",
				[9444] = "完成【药剂初尝】",
				[10446] = "完成【饥饿的“甜心”】",
				[10447] = "完成【饥饿的“甜心”】",
				[10448] = "完成【饥饿的“甜心”】",
				[10449] = "完成【饥饿的“甜心”】",
				[10450] = "完成【饥饿的“甜心”】",
				[10451] = "完成【饥饿的“甜心”】",
				[8585] = "完成【给锡月林地的警告】",
				[8586] = "完成【给幽暗森林的警告】",
				[8589] = "完成【寻宝的帮手】",
				[8590] = "完成【奥卡斯通的买卖】",
				[8591] = "完成【德弗丁的菜谱】",
				[8592] = "完成【酒会的美酒】",
				[8587] = "完成【自然与人力】",
				[8588] = "完成【染料换木料】",
				[8567] = "完成【贤者之眼的馈赠】",
				[8568] = "完成【神射手泰尔亚】",
				[8569] = "完成【爱神泉的求助】",
				[8570] = "完成【玫瑰之争】",
				[8571] = "完成【天空守望者的求助】",
				[8572] = "完成【魔女的交易】",
				[8573] = "完成【卖火柴的小女孩】",
				[8574] = "完成【又是正义】",
				[8575] = "完成【幸存的精灵】",
				[8576] = "完成【避风镇的药品商】",
				[9622] = "完成【生还者】",
				[9623] = "完成【画师的愿望】",
				[9624] = "完成【剧毒毒素】",
				[9625] = "完成【腐水蜘蛛】",
				[9626] = "完成【软泥浇灌的怪花】",
				[9627] = "完成【开启宝箱】",
				[9628] = "完成【种族食谱】",
				[9629] = "完成【种族食谱】",
				[9630] = "完成【勘探地表】",
				[9631] = "完成【该死的蛀虫】",
				[9935] = "完成【花汁萃取】",
				[9945] = "完成【哥伦布的种子】",
				[9954] = "完成【锌矿石精选】",
				[9958] = "完成【战备锡矿】",
				[9977] = "完成【旗鱼鱼子酱】",
				[9979] = "完成【又是吵闹的猫】",
				[9983] = "完成【给盗贼送酒】",
				[9984] = "完成【品酒的请求】",
				[9985] = "完成【中效饮食药剂】",
				[9987] = "完成【药剂再尝】",
				[10452] = "完成【饥饿的“甜心”】",
				[10453] = "完成【饥饿的“甜心”】",
				[10454] = "完成【饥饿的“甜心”】",
				},

}
--雷辛格随机事件·时间祭坛
TaskListTextString[14560] = {
--任务描述
	DescriptionText  ="获取附近的时间魔法能量，将能量灌注到祭坛之中。祭坛只接受和异空间时间相符的时间魔法。你需要尝试找到这个时间点。（通过提交能量获得信息）",
	SubmitItemText = "灌注魔法",
	DeliverTalkNpc  = "这是一个异空间的时间魔法祭坛。\r\r你需要获取附近的时间魔法能量，将它灌注到这个石台之中，但是石台只能接受和异空间时间一致的时间魔法能量。\r你可以尝试灌注后通过祭坛的反馈信息猜测真正的时间。\r异空间的时间混乱且不稳定，^006acc你使用越少的次数灌注成功获得的奖励越丰厚^50210f。",
	DeliverTalkPlayer = "我明白了，让我开始吧。",
	AwardTalkNpc = "灌注时间魔法能量！",
	AwardTalkPlayer ="灌注！",
	SubmitItemText ="灌注！",
	SubmitItemPrologue ="灌注时间能量",
	TaskTributeText = {
	[1] = "$name第一次灌注魔法就成功了，获得12倍经验和魂币奖励。",
	[2] = "$name第二次灌注魔法时成功了，获得6倍经验和魂币奖励。",
	[3] = "$name第三次灌注魔法时成功了，获得3倍经验和魂币奖励。",
	[4] = "$name终于灌注魔法成功了，获得了经验和魂币奖励。",
	}
}
--恩德值宝石重铸
TaskListTextString[14572] = {
--任务描述
	DescriptionText  ="耗费恩德值和魂币进行1级宝石重铸。你可以放入任意一块1级宝石，会重铸成另外一块1级宝石，但并不一定是不同种类的宝石。^006acc重铸后的宝石将会绑定。",
	DeliverTalkNpc  = "你可以放入任意一块1级宝石，他可以帮你重铸成另外一块1级宝石，但并不一定是不同种类的宝石。\r^006acc重铸后的宝石将会绑定。\r重铸费用将是恩德值和魂币，每周可以重铸100次，每次耗费的恩德值递增。你愿意进行重铸吗？",
	DeliverTalkPlayer = "我明白了，让我开始吧。",
	AwardTalkNpc = "完成重铸？",
	AwardTalkPlayer ="完成",
	SubmitItemText ="进行宝石重铸",
	SubmitItemPrologue ="这是你本周内的第%d次使用恩德值进行宝石重铸。\r\r消耗恩德值：%d点\r消耗魂币：2金",
	TaskTributeText = "",

}
--恩德值重置流光副本次数
TaskListTextString[14573] = {
--任务描述
	DescriptionText  ="消耗恩德值重置今天的流光之地副本进入次数。",
	DeliverTalkNpc  = "你愿意重置今天的流光之地副本进入次数吗？\r\r^006acc【每天最多重置5次】\r第 1 次：耗费恩德值 200 点\r第 2 次：耗费恩德值 300 点\r第 3 次：耗费恩德值 400 点\r第 4 次：耗费恩德值 500 点\r第 5 次：耗费恩德值 600 点",
	DeliverTalkPlayer = "我要重置。",
	AwardTalkNpc = "",
	AwardTalkPlayer ="",
	TaskTributeText = "",

}
--悬赏信声望换高级符文方式1，计次任务
TaskListTextString[14723] = {
--任务描述
	DescriptionText  ="消耗恩德值和魂币，抽取1级高级符文或者符文碎片",
	DeliverTalkNpc  = "你决定用“普通抽取”的方式抽取1级高级符文或者符文碎片了吗？",
	DeliverTalkPlayer = "我要抽取。",
	AwardTalkNpc = "",
	AwardTalkPlayer ="",
	TaskTributeText = "",

}
--悬赏信声望换高级符文方式2，非计次任务
TaskListTextString[14724] = {
--任务描述
	DescriptionText  ="消耗恩德值重置今天的流光之地副本进入次数。",
	DeliverTalkNpc  = "你决定用“强力抽取”的方式抽取1级高级符文或者符文碎片了吗？",
	DeliverTalkPlayer = "我要抽取。",
	AwardTalkNpc = "",
	AwardTalkPlayer ="",
	TaskTributeText = "",

}
----测试·百层塔测数发装备任务
TaskListTextString[14762] = {
--任务描述
	DeliverTalkNpc ="发装备",
	DeliverTalkPlayer1 = "我要70蓝装",
	DeliverTalkPlayer2 = "我要70紫装",
	DeliverTalkPlayer3 = "我要77蓝装",
	DeliverTalkPlayer4 = "我要77紫装",

}
